[
  {
    "path": "docs/PROGRESS.md",
    "size_bytes": 157,
    "ext": ".md",
    "description": "This file tracks the current status and key milestones of the project, serving as a progress log. It provides a timestamped snapshot of the project's initialization phase and notes on the orchestration setup. This helps stakeholders monitor development stages within the larger system."
  },
  {
    "path": "docs/TODO_MASTER.md",
    "size_bytes": 2157,
    "ext": ".md",
    "description": "This file is an auto-generated master to-do list that organizes and tracks development tasks across multiple project phases such as Backend, Frontend, Ops, QA, and Docs. It assigns priorities and responsible agents to each workstream, serving as a centralized planning and coordination tool within the larger system."
  },
  {
    "path": "ops/config.yaml",
    "size_bytes": 546,
    "ext": ".yaml",
    "description": "This configuration file defines key paths, blueprint documents, AI models, and agent roles for the RastUp1 project environment. It centralizes settings for project structure, AI model selection, and task-specific agents, supporting orchestration of development, DevOps, and QA workflows within the larger system."
  },
  {
    "path": "ops/queue.jsonl",
    "size_bytes": 47068,
    "ext": ".jsonl",
    "description": ""
  },
  {
    "path": "ops/wbs.json",
    "size_bytes": 80438,
    "ext": ".json",
    "description": "The `ops\\wbs.json` file defines the Work Breakdown Structure (WBS) for the project, detailing major operational tasks such as infrastructure setup, security implementation, environment provisioning, and cost management. It organizes these tasks with unique IDs, descriptions, dependencies, assigned agents, and references to related technical blueprints, serving as a foundational planning and tracking document within the larger system's project management and DevOps workflows."
  },
  {
    "path": "orchestrator/blueprints.py",
    "size_bytes": 6422,
    "ext": ".py",
    "description": "This module processes master blueprint documents by converting them to markdown, splitting them into manageable text chunks, generating concise summaries using an LLM, and creating vector embeddings for semantic indexing. It outputs a consolidated JSON index of these enriched chunks to facilitate efficient retrieval and analysis within the larger orchestrator system."
  },
  {
    "path": "orchestrator/cli.py",
    "size_bytes": 23100,
    "ext": ".py",
    "description": "This file implements a command-line interface (CLI) for the orchestrator system, handling project initialization, configuration loading, and blueprint ingestion. It sets up the necessary directory structure and default config files within the project repository, manages interaction with large language model clients, and integrates blueprint documents into the system. Overall, it serves as the entry point for users to initialize and manage the orchestrator environment and its AI-driven components."
  },
  {
    "path": "orchestrator/llm_client.py",
    "size_bytes": 3700,
    "ext": ".py",
    "description": "This file defines an LLMClient class that provides a unified interface to interact with OpenAI and optionally Anthropic large language models for embedding generation and chat completions. It encapsulates configuration and API calls, supporting OpenAI as the primary engine and Anthropic for specialized tasks like long-form summarization. This client serves as a core component in the orchestrator system to facilitate LLM-based indexing, planning, and document synthesis."
  },
  {
    "path": "orchestrator/__init__.py",
    "size_bytes": 334,
    "ext": ".py",
    "description": "This file initializes the RastUp Orchestrator package, which serves as the central controller for ingesting and indexing blueprint documents, building the work breakdown structure (WBS) and task queue, and dispatching tasks to Cursor agents via CLI. It also manages basic state and documentation, acting as the main coordination layer within the larger system."
  },
  {
    "path": "ProjectPlans/Combined_Master_PLAIN_Non_Tech_001.docx",
    "size_bytes": 572255,
    "ext": ".docx",
    "description": ""
  },
  {
    "path": "ProjectPlans/TechnicalDevelopmentPlan.odt",
    "size_bytes": 1718943,
    "ext": ".odt",
    "description": ""
  },
  {
    "path": "docs/blueprints/blueprint_index.json",
    "size_bytes": 89420399,
    "ext": ".json",
    "description": ""
  },
  {
    "path": "docs/blueprints/non_tech_source.md",
    "size_bytes": 2184855,
    "ext": ".md",
    "description": ""
  },
  {
    "path": "docs/blueprints/tech_source.md",
    "size_bytes": 1305094,
    "ext": ".md",
    "description": ""
  },
  {
    "path": "docs/blueprints/non-tech/NT-0000.md",
    "size_bytes": 4260,
    "ext": ".md",
    "description": "This file defines the Work Breakdown Structure and detailed design for a multi-role user profile system within a non-technical blueprint. It specifies how a single user account can manage multiple distinct \"Service Profiles\" (e.g., Model, Photographer, Videographer, Content Creator), each with role-specific data, portfolios, rates, and booking capabilities, while sharing global account elements. This structure supports clear search, booking, and navigation flows, fitting into the larger platform by organizing talent supply and role verticals for streamlined user experience and marketplace operations."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0001.md",
    "size_bytes": 4255,
    "ext": ".md",
    "description": "This document defines the blueprint for managing non-technical service profiles (SPs) within a platform, detailing role-specific attributes, search and discovery mechanisms, booking workflows, reviews, messaging, and portfolio management. It structures how different creative roles (e.g., models, photographers, videographers, content creators) are represented, searched, and engaged with, ensuring role-specific data indexing and user interactions. This file serves as a foundational guide for implementing and integrating non-tech service provider features into the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0002.md",
    "size_bytes": 4243,
    "ext": ".md",
    "description": "This document outlines the design and feature specifications for a multi-role service provider platform, focusing on media management, user interactions, verification incentives, and role-specific controls. It details how portfolios, tagging, follows, posts, verification badges, admin safety, analytics, and UX edge cases are handled to support role-based profiles and bookings. Serving as a blueprint, it guides development of a non-technical system layer that ensures role-aware user experience, content organization, and operational insights within the larger platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0003.md",
    "size_bytes": 4238,
    "ext": ".md",
    "description": "This document defines the scope, acceptance criteria, and design rationale for managing multiple non-technical user roles and service profiles within a platform, focusing on role-specific search, bookings, reviews, and verification features. It introduces new roles like \"FanSubscription Creator\" with content policies and age gating, and distinguishes between personal service profiles and space listings (Studios) to maintain clarity in search and booking workflows. Overall, it guides the implementation of a unified, role-anchored user experience that supports multi-role accounts while ensuring safety, transparency, and scalability."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0004.md",
    "size_bytes": 4257,
    "ext": ".md",
    "description": "This document defines the distinctions and relationships between Service Profiles (people/roles) and Studio Listings (places/spaces) within the system, detailing their data models, verification processes, reviews, and booking policies. It establishes how accounts can own multiple profiles and studios, how optional linking between profiles and studios works for UI display, and clarifies separate reputation and policy handling for each entity type. This blueprint ensures clear, scalable management of talent and space offerings to support precise search, booking, and reputation features in the larger platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0005.md",
    "size_bytes": 4254,
    "ext": ".md",
    "description": "This file (NT-0005.md) documents the design and user experience of a global search and filtering system for non-technical roles such as models, photographers, videographers, and content creators. It details role-specific search filters, global filters, and result card features that help buyers quickly find and book suitable professionals based on availability, budget, reliability, and relevant attributes. This blueprint fits into a larger platform aimed at connecting buyers with creative talent through an intuitive, commercially focused search and booking interface."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0006.md",
    "size_bytes": 4239,
    "ext": ".md",
    "description": "This document outlines a non-technical blueprint for a creator services platform, detailing features like verified social metrics integration, package and extras management, and streamlined booking workflows. It specifies how creators can connect social accounts for live, consented data display, offers tiered service packages with add-ons, and introduces tools like Instant Book, Smart Invites, and Concierge to improve booking efficiency. Overall, it supports a marketplace model that facilitates transparent, scalable collaborations between creators and buyers."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0007.md",
    "size_bytes": 4230,
    "ext": ".md",
    "description": "This document outlines key non-technical features and policies for a creator collaboration platform, including monetization models, collaboration contracts, audience targeting, content and NSFW guidelines, posting workflows, and user verification processes. It serves as a blueprint for platform rules, user experience design, and compliance strategies, guiding development and operational decisions within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0008.md",
    "size_bytes": 4231,
    "ext": ".md",
    "description": "This document (NT-0008) outlines the design and implementation details for a non-technical blueprint focused on enhancing a booking platform with verification processes, role-specific search filters, and tiered analytics offerings. It specifies how verifications are monetized, the structure of core and pro analytics for providers, acceptance criteria for features like Instant Book and NSFW policies, and competitive advantages over similar platforms. Overall, it serves as a strategic plan to improve user trust, booking efficiency, and data-driven insights within a larger marketplace or talent booking system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0009.md",
    "size_bytes": 4233,
    "ext": ".md",
    "description": "This document defines the detailed search, filtering, and booking system for non-technical service profiles (Models, Photographers, Videographers, Creators) within a talent marketplace platform. It specifies role-specific attributes, verification levels, package structures, and booking options like Instant Book to facilitate efficient talent discovery and engagement. As part of the larger system, it guides the user interface and backend logic for matching buyers with verified talent based on customizable criteria and streamlined booking workflows."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0010.md",
    "size_bytes": 4254,
    "ext": ".md",
    "description": "This document outlines the design and rules for non-technical features related to talent booking, social media metrics integration, content policies, and feed management within the platform. It specifies mechanisms like Instant Book, Smart Invites, and Autoaccept to streamline booking workflows, details how verified social metrics are collected and displayed, enforces NSFW and OnlyFans content guidelines, and describes a role-based, multi-tag feed system. Overall, it serves as a blueprint guiding the implementation of user interaction, content moderation, and data integration components in the larger talent marketplace system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0011.md",
    "size_bytes": 4279,
    "ext": ".md",
    "description": "This document (NT-0011.md) outlines the design and implementation details for advanced social media search and filtering features within a larger system, focusing on verified and unverified social metrics across multiple platforms. It specifies how engagement metrics are computed, how platform-specific filters and toggles operate, and how trust signals and boosting integrate into search ranking and results. Overall, it serves as a blueprint for enhancing non-technical user interfaces to enable granular, trustworthy social profile searches with phased platform support."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0012.md",
    "size_bytes": 4251,
    "ext": ".md",
    "description": "This document defines the reputation and ranking system, search filters, and policy rules for non-technical creators and models within a platform, including eligibility criteria, promoted placement rules, and content boundaries. It details how search results are filtered and displayed—covering nudity tiers, comfort and boundary settings, fan-subscription creators, and age/policy gating—to ensure compliance and user safety. As part of the broader system, it guides search and discovery features, monetization through paid boosting, and booking workflows with enforced content and verification policies."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0013.md",
    "size_bytes": 4293,
    "ext": ".md",
    "description": "This document defines new search and filtering features for non-technical user roles within a platform, specifically adding support for FanSubscription Creators and Studios as searchable listing types. It details UI elements, filtering criteria, result display cards, saved search functionality, and ranking logic to enhance discovery and booking workflows. Overall, it integrates these roles into the broader talent search system while maintaining user safety and quality controls."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0014.md",
    "size_bytes": 4261,
    "ext": ".md",
    "description": "This document (NT-0014.md) outlines the design and acceptance criteria for integrating studio bookings into a talent marketplace platform, detailing search filters, ranking logic, and user interface elements like the \"Attach a Studio\" feature. It also specifies booking workflows, payment processes, and dispute handling to ensure fast, trustworthy transactions similar to Airbnb or Fiverr. Overall, it serves as a blueprint for adding studio-related functionality that complements talent search and booking within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0015.md",
    "size_bytes": 4243,
    "ext": ".md",
    "description": "This document outlines the non-technical blueprint for a booking and payment system tailored to creative services, detailing buyer and provider workflows from invitation and offer selection through escrow, contract management, and payouts. It defines key processes such as private invites, contract auto-attachments, milestone-based delivery, dispute windows, and a tiered fee structure designed to balance platform revenue with user incentives. As part of a larger platform, it ensures streamlined transactions, risk management, and flexible add-ons to reduce friction and enhance trust between parties."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0016.md",
    "size_bytes": 4246,
    "ext": ".md",
    "description": "This document outlines the policies and workflows for non-technical aspects of a service marketplace, including post-checkout extras, travel/expense handling, rescheduling and cancellation rules, dispute resolution, contract management, anti-circumvention measures, safety protocols, and tax compliance. It defines how providers and buyers interact around bookings, payments, and conflicts, ensuring clear agreements, fair dispute processes, and regulatory adherence. This file serves as a key reference for operational procedures that support the platform’s transactional integrity and user protections."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0017.md",
    "size_bytes": 4265,
    "ext": ".md",
    "description": "This document (NT-0017) outlines the non-technical specifications and workflows for a booking and payout system within a service marketplace platform. It details features such as provider and buyer dashboards, notification and calendar integrations, booking modes with escrow and dispute handling, fee structures, and travel pricing policies to ensure fair, transparent, and efficient transactions. The file serves as a blueprint guiding engineering, QA, and product teams on functional requirements and rationale to improve booking conversion and user experience."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0018.md",
    "size_bytes": 4248,
    "ext": ".md",
    "description": "This document outlines the rules and workflows for managing travel fees, booking guardrails, and related logistics for non-technical service providers within a larger booking platform. It defines travel zones, instant booking limits, longhaul policies, and how travel costs are calculated and integrated into checkout and escrow processes. Additionally, it addresses buyer search filters, day-of transportation options, and safeguards to prevent invalid bookings, ensuring clear expectations and smooth coordination between buyers and talent."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0019.md",
    "size_bytes": 4239,
    "ext": ".md",
    "description": "This document outlines the platform’s policies and workflows for handling travel-related fees, payments, and escrow in bookings, including UI elements and acceptance criteria for travel arrangements. It also details the Smart Docs Engine that automates contract generation, e-signatures, and enforceability of legal paperwork required before starting a job, ensuring clarity and compliance for all parties. Overall, it integrates travel logistics and legal documentation into the booking and payment system to streamline non-technical project management."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0020.md",
    "size_bytes": 4239,
    "ext": ".md",
    "description": "This document (NT-0020) outlines the integration of talent and studio bookings within a platform, detailing booking types, linked booking groups, payment flows including escrow and deposits, and associated legal and safety addenda. It defines rules for booking, checkout, rescheduling, and onsite procedures to ensure smooth coordination between talent and studio services while maintaining clear policies and user rights. This file serves as a blueprint for managing combined bookings and payments in the platform’s non-technical project plans."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0021.md",
    "size_bytes": 4245,
    "ext": ".md",
    "description": "This document defines detailed policies and workflows for managing non-technical booking operations involving talent and studio services, including pricing adjustments, check-in/out procedures, cancellations, damage claims, payouts, taxes, and safeguards. It serves as a comprehensive blueprint to ensure consistent handling of group bookings, disputes, and edge cases within the platform’s booking and fulfillment system. The file fits into the larger system by standardizing operational rules and event tracking to support smooth coordination between buyers, hosts, and the platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0022.md",
    "size_bytes": 4268,
    "ext": ".md",
    "description": "This file documents the design and requirements for a non-technical blueprint focused on studio bookings and messaging workflows within a larger platform. It details booking lifecycle management—including pricing, deposits, check-in/out, disputes, payouts—and a role- and booking-aware messaging system that centralizes communication, collaboration, and project data. Together, these components ensure clear, fair, and scalable operations supporting studio rentals and associated user interactions."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0023.md",
    "size_bytes": 4287,
    "ext": ".md",
    "description": "This file documents the design and features of a non-technical messaging and project collaboration system tailored for managing bookings, inquiries, and disputes within a creative talent marketplace. It details the user interface layout, message handling (including filters, credits, and spam controls), comprehensive project panels with scheduling, briefs, deliverables, contracts, and collaborative chat actions. This blueprint serves as a guide for implementing seamless communication and project management workflows between buyers and providers in the larger platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0024.md",
    "size_bytes": 4239,
    "ext": ".md",
    "description": "This document (NT-0024) defines the specifications and guardrails for a non-technical project module focused on file handling, safety, moderation, notifications, roles, and integrations within a larger booking and collaboration system. It outlines supported file types and limits, safety features like abuse reporting and automoderation, anticircumvention measures, notification settings, and role-based permissions, ensuring secure and efficient communication and delivery between buyers, providers, and collaborators. The blueprint also details how this module ties into other system components such as booking, payments, search, and user verification to support a seamless project workflow."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0025.md",
    "size_bytes": 4260,
    "ext": ".md",
    "description": "This document outlines the specifications and acceptance criteria for a non-technical project management and communication system, detailing features for an MVP and a Phase 2 roadmap. It defines core functionalities like a unified inbox, project panel, action cards, file handling, safety measures, and provider-managed booking changes with audit trails, aiming to streamline booking workflows and enhance user trust. The file serves as a blueprint guiding engineering and QA teams on feature implementation and rationale within a larger platform for managing bookings and collaborations."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0026.md",
    "size_bytes": 4262,
    "ext": ".md",
    "description": "This document defines the rules and workflows for managing contract amendments between buyers and providers in a service booking system, including handling time, location, price changes, refunds, and fee adjustments. It specifies automated and manual approval processes, escrow and fee logic, notification updates, dispute resolution, and abuse prevention mechanisms. This ensures transparent, fair, and real-time updates to bookings while maintaining system integrity and user trust."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0027.md",
    "size_bytes": 4251,
    "ext": ".md",
    "description": "This document (NT-0027) defines non-technical operational procedures and system rules for managing photography/video shoot bookings, including scheduling changes, fee adjustments, and deliverable upgrades, ensuring buyer consent and accurate escrow handling. It also specifies the hybrid storage and delivery model for large media files, combining on-platform previews with off-platform original file hosting, while maintaining secure access, audit trails, and dispute resolution support. Overall, it enables providers to self-manage bookings and deliverables efficiently while protecting buyer interests and minimizing platform costs and disputes."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0028.md",
    "size_bytes": 4240,
    "ext": ".md",
    "description": "This document (NT-0028) defines non-technical specifications and operational rules for content delivery, provider responsibilities, and user trust & safety within the platform. It outlines manifest-based acceptance criteria for file deliveries, OAuth and API usage constraints, and detailed user verification levels to ensure secure, compliant, and transparent marketplace interactions. As part of the broader system, it supports reliable content handling and enforces safety policies to foster user confidence and reduce fraud or abuse."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0029.md",
    "size_bytes": 4256,
    "ext": ".md",
    "description": "This document outlines the verification, safety, moderation, and fraud prevention features for a non-technical project, detailing various user badges, safety protocols, content policies, and risk management processes. It defines how users earn trust signals, how bookings and communications are secured, and the enforcement mechanisms to maintain platform integrity. This blueprint serves as a foundational guide for implementing user trust and safety systems within the larger platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0030.md",
    "size_bytes": 4270,
    "ext": ".md",
    "description": "This document outlines a comprehensive safety and trust framework for a platform, detailing policies, operational procedures, user incentives, and technical measures to prevent fraud, abuse, and ban evasion. It defines verification tiers, enforcement protocols, evidence retention, and user-facing safety resources, as well as metrics and acceptance criteria for engineering and operations teams. This blueprint serves as a foundational guide to integrate safety, trust, and moderation features into the larger system, ensuring user protection and platform integrity."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0031.md",
    "size_bytes": 4259,
    "ext": ".md",
    "description": "This document defines enhancements to the platform’s trust, safety, and verification systems, including features like studio and location verification, reputation scoring, safety flags, and evidence retention for disputes. It outlines operational workflows such as triage queues, enforcement ladders, and privacy controls that support safer bookings and reduce fraud or disputes. These additions integrate with existing search and booking components to improve user confidence and platform reliability in non-technical project areas."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0032.md",
    "size_bytes": 4246,
    "ext": ".md",
    "description": "This document outlines the trust, safety, verification, and reputation frameworks for non-technical aspects of the platform, including user and studio identity verification, content policies, and safety enforcement measures. It defines how reputation scores and verification badges are computed and used in search filtering, details data privacy practices, and specifies rules for acceptable content and studio bookings to ensure compliance and user protection. The file fits into the larger system by supporting platform integrity, user trust, and regulatory compliance through clear policies and enforcement workflows."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0033.md",
    "size_bytes": 4249,
    "ext": ".md",
    "description": "This document outlines comprehensive non-technical safety, privacy, accessibility, and conduct guidelines for studio hosts and talent within a booking platform. It defines rules for onsite behavior, surveillance disclosure, hazard management, emergency procedures, anti-discrimination policies, and enforcement actions to ensure a safe and compliant environment. Serving as a blueprint, it supports platform policies and user experience by standardizing safety protocols and responsibilities across studio listings."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0034.md",
    "size_bytes": 4245,
    "ext": ".md",
    "description": "This document defines non-technical blueprints for user safety, verification, and support processes within a studio booking platform. It outlines lightweight preshoot safety tips, studio verification requirements, privacy and hazard policies, and a tiered enforcement system to protect users and the brand. Additionally, it specifies a multi-channel, self-serve-first support framework with guided flows and contextual help to efficiently resolve user issues while minimizing operational overhead."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0035.md",
    "size_bytes": 4276,
    "ext": ".md",
    "description": "This document outlines the operational procedures and ticketing taxonomy for handling non-technical support issues such as payments, payouts, rescheduling, cancellations, disputes, verification, safety incidents, refunds, and credits. It defines categories, priorities, SLAs, and workflows for managing customer and provider interactions within a larger platform support system. Additionally, it provides guidance on knowledge base structure and content standards to ensure consistent user assistance across roles and topics."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0036.md",
    "size_bytes": 4265,
    "ext": ".md",
    "description": "This document (NT-0036) outlines the design and operational plan for a non-technical Help Center and support system within a larger platform. It details content strategy, internal tools, automation workflows, policy playbooks, metrics tracking, accessibility/localization, and phased feature rollouts to improve user self-service, ticket handling, and support quality. The file serves as a blueprint guiding engineering and operations teams in building and maintaining an effective customer support experience integrated with booking and safety workflows."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0037.md",
    "size_bytes": 4204,
    "ext": ".md",
    "description": "This file documents two key non-technical blueprints: first, the design and workflow of the customer support system, including in-product help, ticketing, agent tools, safety triage, and performance dashboards; second, a structured go-to-market and city launch plan outlining market research, regulatory checks, operational fit, and KPI-driven milestones for geographic expansion. Together, these blueprints guide support operations and strategic growth within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0038.md",
    "size_bytes": 4178,
    "ext": ".md",
    "description": "This document outlines the standardized city launch playbook for non-technical teams, detailing the setup of dedicated launch teams, local operations, and tailored marketing strategies. Its main responsibilities include defining KPIs, ensuring regulatory compliance, recruiting local talent, and executing localized customer acquisition to ensure consistent and scalable market entries. It fits into the larger system as a key operational blueprint guiding successful expansion into new cities."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0039.md",
    "size_bytes": 4178,
    "ext": ".md",
    "description": "This document outlines a localized marketing and launch strategy for introducing a product or service into new cities. It details a mix of geo-targeted digital advertising, community engagement, local partnerships, and iterative customer acquisition tactics tailored to each city's unique culture. As part of a broader go-to-market plan, it guides teams through phased launch milestones to build early user adoption and establish strong local brand presence."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0040.md",
    "size_bytes": 4177,
    "ext": ".md",
    "description": "This document outlines a phased, milestone-driven city launch plan for expanding services into new locations, detailing pre-launch preparation, launch execution, and knowledge transfer to local teams. It establishes clear timelines, key activities, and success metrics to ensure disciplined rollouts and smooth transitions to local operational control. Additionally, it describes post-launch monitoring and scaling strategies to support ongoing growth and maintain quality across launched cities within the larger expansion system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0041.md",
    "size_bytes": 4175,
    "ext": ".md",
    "description": "This document outlines a structured post-launch review and expansion strategy for city-based operations, focusing on tracking KPIs, maintaining quality standards, and fostering knowledge sharing across city teams. It emphasizes sustainable, phased growth by evaluating each city's performance before scaling further, while promoting cross-city collaboration and continuous improvement. This blueprint supports consistent service delivery and operational excellence as part of the broader go-to-market rollout plan."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0042.md",
    "size_bytes": 4183,
    "ext": ".md",
    "description": "This document outlines a phased city expansion plan for launching and scaling a core service in multiple markets, detailing milestone-driven goals and success metrics for each phase. It defines a tiered rollout strategy with tailored KPIs based on market maturity, and emphasizes continuous monitoring and iterative improvement to ensure sustainable growth. As part of the broader non-technical project blueprints, it guides strategic decision-making for market entry and scaling efforts."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0043.md",
    "size_bytes": 4186,
    "ext": ".md",
    "description": "This document outlines a dynamic city launch playbook for non-technical teams, detailing key performance metrics, iterative strategies, and best practices for expanding service markets sustainably. It serves as a living guide to track supply and demand, customer engagement, unit economics, and cross-city learnings to optimize growth and market leadership. Positioned within the larger system, it supports coordinated, data-driven market launches and continuous improvement across multiple cities."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0044.md",
    "size_bytes": 4231,
    "ext": ".md",
    "description": "This file outlines the launch strategy and scope for integrating a curated \"Verified Studios (Lite)\" marketplace within a talent discovery and booking platform, focusing on photo/video shoot spaces as a complementary add-on rather than a full venue marketplace. It details MVP features such as studio discovery, booking mechanics, verification, and payment policies, while deferring complex functionalities like insurance and multi-city expansion until after product-market fit. Overall, it guides how studios enhance conversion and user experience without competing directly with established venue platforms."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0045.md",
    "size_bytes": 4240,
    "ext": ".md",
    "description": "This document outlines the strategy and implementation plan for integrating creative studio spaces (\"Verified Studios\") into a talent booking platform, focusing on supply seeding, demand generation, user experience, and monetization mechanics. It defines key features like studio add-ons, booking policies, verification flows, and KPIs to measure success, ensuring studios complement rather than distract from the core talent marketplace. The file serves as a blueprint for launching and scaling the studio booking functionality within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0046.md",
    "size_bytes": 4255,
    "ext": ".md",
    "description": "This document defines the platform's fee structure, including provider commissions, buyer service fees, discounts, and refund policies, benchmarking them against competitors to ensure competitive yet sustainable economics. It also outlines payment processing details, escrow and payout timing, and examples to align Finance and Product teams on fee calculations. Overall, it serves as a key reference for monetization strategy within the larger marketplace system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0047.md",
    "size_bytes": 4255,
    "ext": ".md",
    "description": "This document (NT-0047) defines the platform's fee structure, pricing transparency rules, and related policies for buyer and provider transactions. It details fee calculations, discounts, refund rules, payout timing, and anti-leakage incentives, ensuring clear communication and sustainable economics within the marketplace. As part of the non-technical blueprints, it guides product and operations teams on implementing and managing platform fees and user experience around payments."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0048.md",
    "size_bytes": 4236,
    "ext": ".md",
    "description": "This document outlines detailed pricing, fee structures, and policies for studio bookings within the platform, including provider and buyer fees, discounts, refunds, and handling of linked bookings combining talent and studio services. It serves as an addendum to core monetization mechanics, ensuring clarity and consistency in how fees are applied and managed for non-technical stakeholders. This file fits into the larger system by defining non-technical policy and pricing guidelines that support platform revenue and user experience for studio-related transactions."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0049.md",
    "size_bytes": 4269,
    "ext": ".md",
    "description": "This document defines the detailed fee structure, payment processing assumptions, and refund policies for studio bookings within the platform, including worked examples and special cases like chargebacks and deposits. It ensures transparent, predictable economics for buyers and hosts, integrates with broader booking and monetization systems, and supports scalable operations through clear ledger and receipt management. Overall, it serves as a key reference for implementing and managing non-technical financial rules related to studio transactions in the platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0050.md",
    "size_bytes": 4277,
    "ext": ".md",
    "description": "This document outlines the pricing, tier structure, and monetization strategy for a non-technical platform focused on service bookings, emphasizing fairness, trust, and gradual monetization. It details free features at launch, earned trust perks, and optional usage-based paid add-ons designed to encourage early adoption and platform liquidity before introducing subscription tiers. The file fits into the larger system as a blueprint guiding the platform’s business model, user incentives, and feature access policies."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0051.md",
    "size_bytes": 4295,
    "ext": ".md",
    "description": "This document (NT-0051) outlines the non-technical blueprint for the platform’s launch strategy, focusing on user incentives, feature gating, and economic models to drive adoption and growth. It defines storage tiers, messaging credit systems, fairness and ranking rules, launch promotions, and criteria for introducing a paid Pro plan, all designed to balance user experience, trust, and profitability. The file fits into the larger system as a strategic guide ensuring aligned incentives, scalable trust mechanisms, and measurable success metrics for the platform’s initial rollout and future monetization."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0052.md",
    "size_bytes": 4259,
    "ext": ".md",
    "description": "This document outlines the design and pilot plan for a paid boosting and promotion system aimed at non-technical service providers, detailing pricing, eligibility, placement rules, and fairness guardrails. It ensures paid visibility supplements but does not replace organic search results, with strict caps and transparency to maintain trust and platform quality. As part of a larger platform, it pilots in Houston to incrementally increase bookings and revenue while safeguarding user experience and organic relevance."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0053.md",
    "size_bytes": 4287,
    "ext": ".md",
    "description": "This document outlines the design and operational plan for a pilot paid promotion system (\"Boost\") targeting non-technical providers and buyers in select cities. It details provider setup, buyer experience, fraud and safety controls, performance KPIs, pricing governance, and launch strategy to ensure fairness, transparency, and ecosystem health. The file serves as a blueprint guiding the implementation and monitoring of this advertising feature within a larger marketplace platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0054.md",
    "size_bytes": 4246,
    "ext": ".md",
    "description": "This document (NT-0054) outlines the design and acceptance criteria for a non-technical project focused on monetization and verification processes within a platform. It defines guardrails and policies for paid search boosts and featured listings to ensure quality, fairness, and safety, while also detailing a tiered, automation-first verification system to build trust and enable key platform features. The file serves as a blueprint guiding implementation and compliance strategies to balance growth, user experience, and risk management in the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0055.md",
    "size_bytes": 4246,
    "ext": ".md",
    "description": "This document (NT-0055) outlines a multi-tiered user verification and background check system for a platform, detailing processes for identity verification, background screening, and studio/location validation to unlock badges and platform features. It covers user experience flows, cost and monetization strategies, operational models including automation and manual review, as well as compliance with legal and data privacy standards. This blueprint serves as a key component in the platform’s trust and safety infrastructure, enabling secure user interactions and eligibility gating within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0056.md",
    "size_bytes": 4259,
    "ext": ".md",
    "description": "This document outlines the design and implementation plan for a multi-phase verification system within a marketplace platform, focusing on identity, background, and studio verification to build trust and ensure compliance. It details verification workflows, incentives, KPIs, pricing, and operational guardrails to balance user experience, cost control, and growth scalability. The file serves as a blueprint guiding product, engineering, and operations teams in deploying and tuning verification features that enhance booking confidence and platform safety."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0057.md",
    "size_bytes": 4249,
    "ext": ".md",
    "description": "This file outlines the NT-0057 blueprint for a non-technical system enabling buyers (brands, agencies, studios, creators) to efficiently create briefs, invite providers, compare proposals, and award jobs with integrated escrow and e-signature workflows. It defines user personas, key features like Smart Invite and RFP Broadcast, proposal handling, and delivery management, emphasizing speed, trust, fairness, and usage-based monetization. This blueprint fits into a larger platform facilitating streamlined, secure, and transparent project sourcing and fulfillment without subscription barriers."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0058.md",
    "size_bytes": 4256,
    "ext": ".md",
    "description": "This document outlines a comprehensive non-technical project blueprint detailing workflows for awarding services, document management with e-signatures, delivery verification, acceptance and revision processes, promotional deliverables enforcement, attendance and dispute resolution, collaboration tools, and concierge support. It defines system behaviors such as escrow handling, automated checks, buyer/provider interactions, and compliance monitoring, serving as a key reference for implementing and coordinating various operational modules within a larger service delivery platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0059.md",
    "size_bytes": 4268,
    "ext": ".md",
    "description": "This document outlines the design and operational plan for a non-technical platform module focused on managing buyer-seller interactions, including scheduling, privacy controls, payment verification, and content safety. It details features like Smart Invites, RFP broadcasts, escrow and contract integrations, analytics dashboards, and quality KPIs to ensure trust, efficiency, and dispute reduction. Serving as a blueprint, it guides the implementation of core workflows and user roles within a larger talent sourcing and project management system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0060.md",
    "size_bytes": 4230,
    "ext": ".md",
    "description": "This document (NT-0060) outlines the design and workflow specifications for non-technical seller tools and processes within a larger platform, focusing on roles like Models, Photographers, Videographers, and Creators. It details features such as onboarding wizards, package templates, trust and verification mechanisms, and dispute prevention strategies to streamline job booking, delivery, and payouts. The file fits into the system by defining how sellers interact with the platform to create clear, scalable, and trust-based service profiles that integrate with analytics, escrow, and project management components."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0061.md",
    "size_bytes": 4254,
    "ext": ".md",
    "description": "This document defines standardized package templates, pricing controls, calendar management, messaging workflows, and smart contract clauses for non-technical seller roles (e.g., photographers, videographers, models, creators) on a service marketplace platform. It ensures consistent quoting, availability handling, lead pipeline management, and policy enforcement to streamline booking, pricing, and delivery processes. Overall, it supports seller operations and buyer interactions within the larger platform ecosystem."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0062.md",
    "size_bytes": 4294,
    "ext": ".md",
    "description": "This document (NT-0062) outlines detailed non-technical project plans and feature specifications for a digital marketplace platform, covering seller workflows such as licensing, delivery, proofing, portfolio management, reputation scoring, payouts, analytics, team collaboration, mobile essentials, and key performance indicators. It serves as a comprehensive blueprint guiding the development and operational standards for seller-side functionality and performance metrics within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0063.md",
    "size_bytes": 4254,
    "ext": ".md",
    "description": "This document outlines the acceptance criteria and detailed feature specifications for a non-technical project focused on seller onboarding, package templates, delivery workflows, and reputation management within a marketplace platform. It defines tools and processes such as onboarding wizards, pricing intelligence, smart document handling, delivery manifests, and verification steps designed to reduce friction, improve trust, and control costs. As part of the larger system, it supports seller-side workflows and quality assurance to enhance booking efficiency, dispute reduction, and marketplace trustworthiness."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0064.md",
    "size_bytes": 4241,
    "ext": ".md",
    "description": "This document outlines the design and acceptance criteria for a role-specific review, reputation, and incentive system within a platform that facilitates bookings between creators and buyers. It defines how verified, fair, and role-aware feedback is collected, structured, and displayed to build trust and reward reliability without enabling review manipulation. The system integrates with onboarding, booking completion, and profile/search displays to enhance transparency and encourage professional conduct across the platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0065.md",
    "size_bytes": 4280,
    "ext": ".md",
    "description": "This document defines the design and rules for a reputation and incentive system within a platform, detailing how reputation scores for buyers and providers are computed, decayed, and protected against gaming. It specifies components like reputation inputs, behavior-shaping incentives, anti-abuse moderation policies, and visibility of buyer reputation to providers. This system supports trust, ranking, and privilege gating in the larger marketplace or collaboration platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0066.md",
    "size_bytes": 4280,
    "ext": ".md",
    "description": "This document defines the design and operational details of the Buyer/Brand Reputation system within a marketplace platform, outlining how buyer reputation scores are calculated, displayed to providers, and integrated into search ranking, access controls, and feature gating. It specifies review processes, moderation policies, incentives, KPIs, and analytics to ensure trust, fairness, and behavior improvement, thereby supporting user retention and growth loops. Overall, it serves as a blueprint for managing buyer reputation to enhance platform trust and engagement."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0067.md",
    "size_bytes": 4304,
    "ext": ".md",
    "description": "This document outlines the design principles, user lifecycle stages, key health metrics, and core engagement loops for a non-technical platform connecting buyers and sellers (e.g., models, photographers, creators). It details how various feedback and trust-building loops—such as booking, reviews, tagging, content sharing, and verification—work together to drive user retention, growth, and fair visibility without paywalls. As part of the broader system, it guides product and growth strategies to foster crossside interactions, reinforce trust, and maintain user safety and satisfaction."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0068.md",
    "size_bytes": 4261,
    "ext": ".md",
    "description": "This document outlines a comprehensive feature blueprint for a non-technical system focused on user engagement, retention, and referral mechanisms within a marketplace platform. It details functionalities such as verification and trust-building loops, tailored retention features for buyers and sellers, referral credit systems with fraud prevention, notification management, and user activity feeds. Overall, it serves as a strategic plan to enhance platform interaction, booking rates, and user loyalty through targeted incentives and communication workflows."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0069.md",
    "size_bytes": 4293,
    "ext": ".md",
    "description": "This document (NT-0069) outlines detailed project plans and acceptance criteria for non-technical features related to user engagement, referral systems, saved searches, feeds, and winback flows within a platform. It defines key experiments, KPIs, and support processes aimed at improving activation, retention, safety, and cost efficiency, while ensuring transparent, evidence-based dispute resolution and user support. As part of the larger system, it guides product development and operational policies to enhance user experience and trust across buyer and seller interactions."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0070.md",
    "size_bytes": 4260,
    "ext": ".md",
    "description": "This document outlines the non-technical operational policies and workflows for customer support, dispute resolution, safety enforcement, and payment handling within the platform. It details service level agreements, self-service options, refund and adjustment rules, chargeback management, safety incident responses, and knowledge base structure, serving as a comprehensive guide for support agents and internal tools. As part of the larger system, it ensures consistent, efficient handling of user issues and policy enforcement to maintain platform trust and compliance."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0071.md",
    "size_bytes": 4280,
    "ext": ".md",
    "description": "This document (NT-0071) outlines detailed policies, workflows, and acceptance criteria for non-technical support processes related to refunds, disputes, safety, and account controls within a larger service platform. It defines self-service flows, refund matrices, evidence handling, staffing SLAs, and key metrics to ensure fair, scalable, and trust-preserving resolution outcomes across different booking types (e.g., Studios, Linked Booking Groups). Serving as a blueprint, it guides support operations, agent tools, and analytics dashboards to maintain consistent user experiences and operational efficiency."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0072.md",
    "size_bytes": 4258,
    "ext": ".md",
    "description": "This document defines the policies, evidence requirements, service-level agreements (SLAs), and operational procedures for managing studio bookings, disputes, and damage claims within a non-technical project context. It outlines standardized outcomes, timelines for claims and adjustments, knowledge base updates, and support tooling features such as an agent console for handling deposit actions and sanctions. Serving as a blueprint, it ensures consistent handling of studio-related issues and integrates with broader booking and dispute resolution systems."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0073.md",
    "size_bytes": 4239,
    "ext": ".md",
    "description": "This document (NT-0073) outlines the UX architecture and product design principles for a marketplace platform connecting talent and studios through role- and place-based offerings. It defines core entities, user flows, and features such as linked booking groups, escrow, messaging, and verification, ensuring a scalable, safe, and accessible experience across mobile and desktop. The file serves as a blueprint guiding coherent screen and flow design to support booking, delivery, review, and support processes within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0074.md",
    "size_bytes": 4323,
    "ext": ".md",
    "description": "This document outlines the comprehensive blueprint for a non-technical project, detailing user flows, surface families (pages and features) for different roles (public, buyer, seller, host, admin), navigation models, ranking and fairness rules, system policies, performance/privacy/safety baselines, and analytics event tracking. It serves as a high-level specification guiding the design and development of the platform’s user experience, business logic, and operational standards within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0075.md",
    "size_bytes": 4256,
    "ext": ".md",
    "description": "This document outlines the non-technical blueprint NT-0075 for a marketplace platform, detailing key entities, user flows, roles, and policies to ensure clarity, scalability, trust, and safety. It defines global navigation, event tracking, risk mitigations, and acceptance criteria to support a city-by-city rollout with consistent user experiences across public, buyer, seller, and admin surfaces. Serving as a foundational reference, it guides development and launch readiness by specifying contracts, UI structure, and operational guardrails."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0076.md",
    "size_bytes": 4259,
    "ext": ".md",
    "description": "This document (NT-0076) outlines the design and feature specifications for various non-technical user interface blueprints within a larger platform, including search hubs, profiles, booking workflows, messaging, and dashboards. It details page routes, key UI components, filters, calls-to-action, and user roles for buyer and talent interactions, integrating studios and talent management. Overall, it serves as a comprehensive reference for building and coordinating front-end user experiences across multiple interconnected modules in the system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0077.md",
    "size_bytes": 4284,
    "ext": ".md",
    "description": "This file documents the non-technical blueprint NT-0077, outlining the key user interfaces and workflows for buyers, sellers, hosts (studios), and cross-cutting system components within a marketplace platform. It details page routes, main features, and call-to-actions (CTAs) for dashboards, onboarding, bookings, payments, messaging, verification, and support, serving as a comprehensive reference for product and development teams. This blueprint fits into the larger system by defining the user experience and functional scope across multiple roles and services."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0078.md",
    "size_bytes": 4283,
    "ext": ".md",
    "description": "This document outlines the global information architecture and navigation for a non-technical project, detailing key routes, user flows, and core features across buyer, seller, host, and admin interfaces. It defines page structures, modals, and critical empty states to ensure a seamless end-to-end experience from onboarding through booking, delivery, and dispute resolution, while supporting scalability and multicity expansion. The file serves as a blueprint to align feature completeness, user actions, and administrative controls within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0079.md",
    "size_bytes": 4309,
    "ext": ".md",
    "description": "This document defines the global information architecture and navigation design for a non-technical system supporting multiple user roles (buyers, sellers, hosts) and entities (people and places) across cities. It specifies desktop and mobile navigation structures, search patterns, and contextual actions to ensure intuitive, scalable access to key workflows like discovery, booking, and support, with a focus on the Houston rollout and multicity scalability. The file serves as a blueprint guiding UI/UX consistency and feature organization within the larger platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0080.md",
    "size_bytes": 4246,
    "ext": ".md",
    "description": "This document outlines the design and functional specifications for the non-technical aspects of a platform's user interface and experience, focusing on features like search, role/context switching, key user actions, safe mode gating, navigation shortcuts, error handling, accessibility, localization, performance, and telemetry. It serves as a blueprint to ensure consistent behavior and integration of these features across the system, supporting different user personas such as buyers, sellers, and studio hosts. Overall, it guides the implementation of a seamless, role-aware, and safe user journey within the larger application ecosystem."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0081.md",
    "size_bytes": 4253,
    "ext": ".md",
    "description": "This document (NT-0081) defines the design and functional specifications for the non-technical blueprint of a user interface header and navigation system across desktop and mobile platforms. It outlines key features such as role-based search filters, safe mode settings, contextual creation menus, and crosslinking between people and studios, ensuring accessibility, internationalization, and performance standards. Additionally, it specifies global design system components including color tokens, typography, spacing, breakpoints, motion, and iconography to maintain a consistent, scalable, and user-friendly experience within the larger application ecosystem."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0082.md",
    "size_bytes": 4319,
    "ext": ".md",
    "description": "This file documents the design and implementation details of global UI components, layout patterns, and interaction elements for a non-technical project blueprint. It covers standardized cards, chips, filters, buttons, steppers, modals, and input controls used across the system to ensure consistent user experience for roles like People and Studios. As part of the larger system, it guides frontend development by specifying reusable components and their behaviors for search, booking, profiles, and checkout workflows."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0083.md",
    "size_bytes": 4275,
    "ext": ".md",
    "description": "This file documents a comprehensive non-technical blueprint outlining UI components, workflows, and feature sets for a platform connecting talent and studios. It covers modules such as messaging, scheduling, payments, document management, reputation, promotions, verification, and notifications, specifying detailed behaviors and design guidelines. Serving as a reference for product and design teams, it ensures consistent implementation and user experience across the system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0084.md",
    "size_bytes": 4247,
    "ext": ".md",
    "description": "This document outlines comprehensive non-technical guidelines and acceptance criteria for UI content, accessibility, performance, telemetry, and onboarding flows within a larger digital platform. It defines standards for microcopy, badges, safety messaging, component behavior, and user verification to ensure consistency, clarity, and trust across user interfaces. Serving as a blueprint, it guides the development and validation of core components and user experiences that support roles, spaces, and progressive verification in a mobile-first, accessible system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0085.md",
    "size_bytes": 4310,
    "ext": ".md",
    "description": "This document outlines the user onboarding and account management processes for a platform connecting buyers, sellers (service providers), and hosts (studio spaces) under a single login. It details progressive verification, safe mode defaults, and tailored onboarding wizards for different user roles to facilitate service listings, bookings, and studio management. As part of the larger system, it defines key user flows, verification incentives, and activation metrics to ensure a secure and efficient marketplace experience."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0086.md",
    "size_bytes": 4304,
    "ext": ".md",
    "description": "This document outlines the detailed specifications and workflows for a non-technical project feature focused on studio listings, user roles, verification processes, onboarding experiences, and safety measures. It defines how users create and manage studio listings via a guided wizard, link multiple roles and profiles, complete progressive verification steps, and engage with activation nudges and safeguards. As part of a larger system, it supports user activation, trust-building, and content policy enforcement to ensure a smooth and secure marketplace experience."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0087.md",
    "size_bytes": 4262,
    "ext": ".md",
    "description": "This document defines the onboarding workflows, role-based profiles, and public-facing storefronts for buyers, sellers, and hosts within a multi-role platform supporting bookings and studio management. It details features like verification, Safe Mode enforcement, intent routing, and profile layouts with portfolio, packages, and reviews, enabling fast, low-friction user activation and trust-building. The blueprint fits into the larger system by orchestrating user journeys, profile presentation, and booking interactions across cities with measurable activation metrics."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0088.md",
    "size_bytes": 4250,
    "ext": ".md",
    "description": "This document (NT-0088) outlines the detailed specifications for managing non-technical user profiles and booking workflows within a creative services platform. It covers role-specific profile fields (models, photographers, videographers, creators), booking and messaging entry points, reviews and reputation systems, updates/posts, policies, and the owner/editor interface for profile management. As part of the larger system, it defines how user profiles are structured, displayed, and interacted with to facilitate bookings, communication, and reputation tracking."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0089.md",
    "size_bytes": 4260,
    "ext": ".md",
    "description": "This file documents the design and acceptance criteria for public role-based profile pages within a non-technical project blueprint. It outlines features such as role-specific analytics, verification prompts, multi-role user experience, safety and privacy measures, performance and accessibility standards, and telemetry events. The profiles serve as bookable storefronts that integrate reputation signals, social metrics, and studio linking to enhance user trust and conversion within a larger platform ecosystem."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0090.md",
    "size_bytes": 4274,
    "ext": ".md",
    "description": "This file defines the blueprint for the \"Studio Listing\" feature within a non-technical project plan, detailing public and host-facing views, booking workflows, and reputation management for studios as bookable spaces. It outlines routes, UI layout, booking widget behavior, and policies to ensure studios are presented as trustworthy, easy-to-book spaces distinct from talent roles. This document fits into the larger system by specifying how studios integrate with talent profiles and the overall marketplace, supporting discovery, booking, and review processes."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0091.md",
    "size_bytes": 4262,
    "ext": ".md",
    "description": "This document outlines the comprehensive blueprint for managing non-technical aspects of a studio rental platform, detailing features like host listing creation, dashboard operations, scheduling, pricing, policies, and cross-selling integrations. It defines workflows for hosts to create and manage studio listings, handle bookings, enforce rules and safety policies, and optimize availability and pricing models. As part of the larger system, it ensures smooth operational, transactional, and compliance processes between hosts, buyers, and platform administrators."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0092.md",
    "size_bytes": 4259,
    "ext": ".md",
    "description": "This document (NT-0092) outlines the design and implementation details for the Studios feature within a larger creator marketplace system, covering studio search, booking, and management flows. It specifies user interface components, accessibility and performance standards, telemetry events, and business rules such as deposits, policies, and verification. The file ensures seamless integration between talent and studio bookings via the AttachinFlow, enabling frictionless pairing and linked bookings while maintaining clear role separation and trust mechanisms."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0093.md",
    "size_bytes": 4291,
    "ext": ".md",
    "description": "This document (NT-0093) specifies the design and functionality of a filtered search interface for non-technical users to find talent (models, photographers, videographers, creators) and studios. It details UI layouts for desktop and mobile, role-based filters, gating rules (including Safe Mode content restrictions), and social metrics integration to refine search results. As part of a larger system, it guides the development of a user-friendly, role-specific discovery tool with content safety and detailed filtering to support talent booking and studio selection."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0094.md",
    "size_bytes": 4294,
    "ext": ".md",
    "description": "This file documents the design and specifications for a platform-wide talent and studio search feature, detailing UI components like result cards, maps, filters, sorting, saved searches, and integration with boards and briefs. It outlines user interactions, accessibility, performance targets, telemetry events, and acceptance criteria to ensure consistent, fair, and efficient search experiences across roles and studios. This blueprint fits into the larger system by defining how non-technical users discover, compare, and engage with talent and studios within the platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0095.md",
    "size_bytes": 4276,
    "ext": ".md",
    "description": "This document (NT-0095.md) specifies the design and functionality of a booking and checkout system for Talent and Studio units within a larger platform. It details user interface elements like PersonCard and StudioCard, search and filtering logic, booking flows including Linked Booking Groups (LBG) that combine Talent and Studio bookings into a single checkout, and the multi-step checkout process covering details, smart document signing, and payment. The file ensures fairness, transparency, and usability by enforcing booking rules, labeling promotions, supporting multiple payment methods, and maintaining performance and accessibility standards."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0096.md",
    "size_bytes": 4270,
    "ext": ".md",
    "description": "This document outlines the non-technical blueprint for a booking and payment workflow involving Talent and Studio services within a platform. It details key steps such as payment methods, fee structures, booking confirmation, edits/reschedules, cancellations, receipts, and error handling, ensuring smooth transaction processing and clear communication with users. This file serves as a comprehensive guide for implementing and managing the booking lifecycle and related user interactions in the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0097.md",
    "size_bytes": 4249,
    "ext": ".md",
    "description": "This file documents the non-technical blueprint NT-0097, detailing the design and acceptance criteria for a multi-booking checkout and delivery system within a larger platform. It outlines key features such as deposit handling, conflict resolution, accessibility, payment methods, telemetry events, and the Delivery Room workflow for managing creative work handoff and approvals. The document ensures clarity on policies, user experience, and technical baselines to reduce disputes and support seamless booking and delivery processes."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0098.md",
    "size_bytes": 4260,
    "ext": ".md",
    "description": "This document (NT-0098) outlines the workflow and system design for managing non-technical deliverables such as proofs, final assets, and UGC/promo posts within a creative content platform. It details roles, deliverable types, verification processes (including API-based social media post validation), automated quality checks, and acceptance workflows that ensure secure, integrity-verified asset handling without hosting large originals. This blueprint fits into the larger system by defining how sellers and buyers interact around content delivery, review, acceptance, and payout in a streamlined, auditable manner."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0099.md",
    "size_bytes": 4266,
    "ext": ".md",
    "description": "This file documents the non-technical blueprint NT-0099, detailing the workflow and system features for managing digital content delivery, validation, revision, acceptance, and dispute resolution in a content marketplace platform. It covers automated technical checks on uploads, revision and commenting processes, download and watermark policies, acceptance and payout triggers, dispute handling, security/privacy measures, UI components, and notification flows. Overall, it defines how the platform ensures content quality, compliance, and smooth transaction lifecycle between buyers and sellers."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0100.md",
    "size_bytes": 4275,
    "ext": ".md",
    "description": "This document (NT-0100.md) outlines the specifications and workflows for a Delivery Room system within a non-technical project blueprint. It details the end-to-end process for managing proofs, selects, and final deliveries with features like autochecks, UGC verification, revision rounds, notifications, telemetry, and acceptance criteria to ensure smooth collaboration between buyers, sellers, and studios. The file fits into the larger system by defining how delivery, acceptance, dispute resolution, and messaging threads operate to reduce disputes, scale efficiently, and maintain clear payout triggers."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0101.md",
    "size_bytes": 4302,
    "ext": ".md",
    "description": "This file documents the messaging and booking blueprint for non-technical users, detailing thread types, message composition, UI layout, credit usage, automation, and quick actions within a talent and studio booking system. It defines how conversations are structured, routed, and managed, including coordination between talent and studio bookings under a unified group (LBG). This blueprint fits into the larger platform by specifying the user interaction and workflow logic for communication and transaction management between buyers and providers."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0102.md",
    "size_bytes": 4279,
    "ext": ".md",
    "description": "This file documents the specifications and acceptance criteria for a non-technical messaging and collaboration system used in talent and studio bookings. It outlines key features such as refund/discount processing, studio access management, safety/privacy controls, inbox organization, LBGAware group collaboration, timezone handling, reliability measures, and telemetry events. The document serves as a blueprint to guide development and ensure the system supports seamless, policy-aware communication and workflow integration within a larger booking and delivery platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0103.md",
    "size_bytes": 4279,
    "ext": ".md",
    "description": "This document outlines the design and features of a non-technical system module focused on managing communication threads, booking coordination, and user reviews within a platform. It details functionalities such as scheduling polls, quick actions (quotes, reschedules, refunds), safety measures (harassment filters, virus scans), and reputation management through verified, double-blind reviews tied to real booking outcomes. The file serves as a blueprint to ensure safer, clearer, and more efficient interactions between buyers, providers, and hosts, integrating policy-aware controls and performance optimizations to reduce support overhead and enhance trust."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0104.md",
    "size_bytes": 4304,
    "ext": ".md",
    "description": "This document defines the reputation and review system for non-technical roles and studio spaces within a larger platform, detailing how reviews are collected, displayed, and scored. It outlines scoring algorithms, moderation policies to prevent abuse, and user interface elements for transparency and safety feedback. Overall, it ensures trustworthy, fair, and safe reputation management for service providers and venues in the ecosystem."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0105.md",
    "size_bytes": 4262,
    "ext": ".md",
    "description": "This document outlines the design and implementation details of a double-blind review and reputation system for a booking platform, focusing on non-technical aspects like feedback collection, safety reporting, unbiased prompting, and metrics tracking. It defines rules for review submission, reputation scoring, anti-gaming measures, and integration with search and user experience flows, ensuring trustworthiness and fairness. The file also covers support and dispute resolution principles to streamline issue handling with clear outcomes and automated evidence gathering."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0106.md",
    "size_bytes": 4263,
    "ext": ".md",
    "description": "This file documents the non-technical blueprint for a dispute resolution system handling talent and studio booking cases, detailing workflows for case types, evidence collection, policy-based outcome calculations, and lifecycle management. It outlines user entry points, self-serve triage steps, automated evidence attachment, and administrative processes to ensure clear, timely resolutions with financial adjustments and privacy safeguards. This blueprint fits into the larger platform by standardizing support interactions and automating dispute handling to maintain trust and operational efficiency."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0107.md",
    "size_bytes": 4310,
    "ext": ".md",
    "description": "This document defines the policies, workflows, and SLAs for handling non-technical support cases such as refunds, disputes, and adjustments within a platform involving talent and studios. It outlines case management processes, money movement rules, notification protocols, and performance metrics to ensure timely, fair resolutions while protecting platform integrity and reputation. Serving as a comprehensive blueprint, it guides agents and users through support interactions and integrates with telemetry and knowledge base systems for operational transparency and efficiency."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0108.md",
    "size_bytes": 4250,
    "ext": ".md",
    "description": "This document (NT-0108.md) outlines the design and acceptance criteria for a non-technical project related to support case management, payment processing, and billing workflows within a larger platform. It details features such as automated evidence attachment, dispute resolution paths, deposit handling, and a comprehensive billing and tax center UX for buyers, sellers, and hosts. The file serves as a blueprint guiding development of user roles, payment flows, notifications, and telemetry to ensure transparent, efficient, and scalable financial operations across multiple user personas."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0109.md",
    "size_bytes": 4254,
    "ext": ".md",
    "description": "This document outlines the non-technical blueprint for the platform's payment and financial workflows, detailing buyer fees, provider fees, payment methods, checkout integration, payout processes, receipts/invoices, promotions wallet, and tax handling. It serves as a comprehensive guide for how money flows through the system, fee structures, tax calculations, and financial reporting, ensuring clarity and consistency across user roles. This blueprint fits into the larger system by defining the financial operations that underpin booking transactions and payouts between buyers, providers, and the platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0110.md",
    "size_bytes": 4238,
    "ext": ".md",
    "description": "This document outlines the non-technical blueprint NT-0110, detailing the system's tax compliance, payment, and notification features within a larger platform. It covers automated W9 collection and validation, tax form generation and delivery (including 1099 forms), budget controls, chargeback handling, and security/privacy compliance measures. Overall, it defines processes ensuring regulatory adherence, user onboarding, financial transactions, and communication workflows for buyers and sellers."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0111.md",
    "size_bytes": 4252,
    "ext": ".md",
    "description": "This document outlines the specifications and acceptance criteria for the billing, tax, and verification components of a larger financial platform. It details compliance-driven features such as automated tax form handling (W9, 1099), payment methods integration, payout management, telemetry events for money and tax actions, and accessibility/performance targets. Additionally, it describes the Verification Center UX aimed at securely verifying users to enable trust and platform access, fitting into the system as a core module for financial operations and user verification compliance."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0112.md",
    "size_bytes": 4263,
    "ext": ".md",
    "description": "This document outlines the verification system for users and studios within the platform, detailing multiple verification types (ID Verified, Trusted Pro, SocialVerified, Studio Verified, etc.), their associated benefits, and gating rules. It specifies the workflows and requirements for identity verification, background checks, social media verification, and related incentives, integrating these processes into user onboarding and trust-building features. Overall, it serves as a blueprint for managing user trust, safety, and eligibility across the system’s admin console and user-facing components."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0113.md",
    "size_bytes": 4253,
    "ext": ".md",
    "description": "This file documents the verification system for non-technical users, detailing processes for social media account linking, studio ownership proof, and security/safety features within the platform. It outlines data privacy practices, admin console workflows for risk and trust management, and user notifications, ensuring verified badges and metrics are accurately displayed. Overall, it supports identity validation and trust-building across user profiles and listings in the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0114.md",
    "size_bytes": 4246,
    "ext": ".md",
    "description": "This file documents the design and implementation details of a comprehensive user verification and trust system within a larger platform. It covers multiple verification flows (ID, background, social, studio), accessibility and performance standards, telemetry events, admin roles and permissions with strict access governance, and privacy and retention policies. The system aims to enhance safety, compliance, and user experience by enforcing verification gates, enabling risk management, and supporting scalable operations with auditability and role-based controls."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0115.md",
    "size_bytes": 4263,
    "ext": ".md",
    "description": "This document outlines the design and operational guidelines for a non-technical admin system managing finance, tax, compliance, content moderation, operations, marketing, and auditing functions. It defines permission scopes, security controls (like SSO, session policies, and just-in-time elevation with two-person approvals), PII handling and redaction, impersonation safeguards, audit logging, and UI safety patterns to ensure secure, compliant, and accountable administrative actions. As part of a larger system, it governs how sensitive data and critical operations are accessed, approved, monitored, and logged to maintain regulatory compliance and operational integrity."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0116.md",
    "size_bytes": 4277,
    "ext": ".md",
    "description": "This file documents non-technical blueprints for admin security, monitoring, and configuration management within a larger system. It outlines alerting and anomaly detection mechanisms for high-risk admin actions, detailed telemetry of admin events, and strict acceptance criteria enforcing multi-factor authentication, role-based access control, just-in-time elevation, and two-person approvals. Additionally, it describes a typed, versioned configuration registry with scoped overrides and safe rollout workflows, enabling operational teams to manage marketplace policies and features dynamically without code deployments."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0117.md",
    "size_bytes": 4284,
    "ext": ".md",
    "description": "This document defines the workflows, feature flags, and editable configuration keys for non-technical project management within a larger system. It outlines approval processes, rollout controls via feature flags, and domain-specific parameters such as fees, refunds, travel, search ranking, promotions, and verification settings, providing guardrails and override scopes to ensure controlled changes. Overall, it serves as a centralized reference for managing operational policies and feature toggles that govern system behavior and user experience."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0118.md",
    "size_bytes": 4278,
    "ext": ".md",
    "description": "This file defines a comprehensive configuration blueprint for non-technical project settings, covering areas such as verification rules, support and disputes, tax and compliance, messaging limits, studio operations, city-specific perks, rollout strategies, admin UI features, service consumption, caching, observability, and telemetry. It specifies default values, validation constraints, approval workflows, and monitoring mechanisms to ensure safe, staged deployments and effective management of system-wide parameters. As part of a larger system, it serves as a centralized source of truth for configurable policies and operational guardrails that govern platform behavior and administrative controls."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0119.md",
    "size_bytes": 4255,
    "ext": ".md",
    "description": "This document outlines operational procedures and system features for managing non-technical configurations, feature flags, and trust & safety operations within a marketplace platform. It details telemetry events, approval workflows, preview and rollback mechanisms for configuration changes, as well as triage processes, SLAs, and evidence preservation protocols for handling safety incidents. Overall, it serves as a comprehensive playbook integrating configuration management with safety operations to maintain platform integrity and responsiveness."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0120.md",
    "size_bytes": 4268,
    "ext": ".md",
    "description": "This document outlines a comprehensive non-technical blueprint for managing safety, compliance, and dispute resolution within a studio booking platform. It details evidence preservation, immediate controls, sanctioning procedures, risk rule automation, background checks, and studio-specific safety protocols to protect buyers and providers. Serving as a key operational guideline, it integrates with broader trust and safety workflows to ensure consistent enforcement and risk mitigation."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0121.md",
    "size_bytes": 4279,
    "ext": ".md",
    "description": "This document outlines the Trust & Safety (T&S) operational blueprint for handling non-technical incidents such as landlord complaints, safety issues, and sanctions within a larger platform. It details immediate mitigation steps, appeals and neutral review processes, integrations with other teams (Content, Support, Finance, Legal), metrics for quality assurance, and the administrative UI for case management. The file serves as a comprehensive guide to ensure fast, fair, and auditable incident resolution workflows, supporting both prevention and response efforts in the system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0122.md",
    "size_bytes": 4264,
    "ext": ".md",
    "description": "This document (NT-0122) outlines the content moderation blueprint for a platform’s non-technical team, detailing policies, automated and human review workflows, and enforcement rules to keep user-generated content safe-for-work (SFW) and compliant. It defines the scope of moderated content types, the multi-stage screening pipeline (upload, automated checks, human review), priority queues with SLAs, and specific rules per content surface to ensure consistent, auditable moderation outcomes. This blueprint fits into the larger system by guiding how content is screened, classified, and managed to protect users and maintain platform quality."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0123.md",
    "size_bytes": 4300,
    "ext": ".md",
    "description": "This document defines the content moderation policies, automated detection systems, user experience flows, enforcement procedures, and moderation tools for non-technical content uploads within the platform. It outlines rules for acceptable imagery and language, automated classifiers and redaction methods, escalation protocols, and integrations with Trust & Safety, Search, Support, and other teams to ensure safe, compliant, and user-friendly content publishing. Serving as a comprehensive blueprint, it guides the end-to-end moderation pipeline from upload through publishing and appeals, supporting operational metrics and quality controls."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0124.md",
    "size_bytes": 4281,
    "ext": ".md",
    "description": "This file documents the design and operational blueprint for a non-technical moderation and support system within a larger platform. It outlines automated content screening pipelines, moderation workflows, user notification and appeal processes, and integration points with Trust & Safety, Support, and other services. Additionally, it details the support and dispute resolution framework, including case intake channels, routing, SLAs, agent tools, and policies to ensure fast, fair, and policy-compliant issue handling."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0125.md",
    "size_bytes": 4262,
    "ext": ".md",
    "description": "This file documents a comprehensive non-technical blueprint outlining policies, calculators, workflows, and automation for handling refunds, disputes, deposits, and related financial adjustments within a platform. It defines key calculators for refund, delivery acceptance, travel fees, and deposit claims, standardizes dispute resolution workflows, and details a Neutral Review Panel process for ambiguous cases. The document integrates policy-driven automation, communication templates, and credit management to ensure consistent, policy-compliant case handling across the system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0126.md",
    "size_bytes": 4289,
    "ext": ".md",
    "description": "This document (NT-0126) outlines the design and operational blueprint for a non-technical case management system focused on support and dispute resolution workflows. It details template management, automated reminders, integrations with finance, tax, content, and analytics systems, as well as quality assurance, telemetry events, and acceptance criteria to ensure consistent, auditable, and policy-compliant handling of cases like refunds, chargebacks, and deposit claims. The file fits into a larger system by coordinating cross-functional processes between support, finance, and operations teams to deliver fast, fair, and transparent outcomes without requiring engineering changes."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0127.md",
    "size_bytes": 4289,
    "ext": ".md",
    "description": "This document outlines the financial operations blueprint for non-technical teams, detailing processes for deposits, payouts, refunds, adjustments, chargebacks, coupons, and reconciliations within the platform. It defines rules, workflows, approvals, and reporting mechanisms to manage money flows, liabilities, and compliance across various transaction types. Serving as a key reference, it ensures consistent handling of financial events and integrates with broader systems like data warehousing, risk management, and finance controls."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0128.md",
    "size_bytes": 4268,
    "ext": ".md",
    "description": "This document outlines the operational blueprint for financial reconciliation, approvals, runbooks, metrics, and telemetry within a non-technical finance operations context. It details processes for daily and month-end reconciliations, dual-approval controls on critical money flows, incident runbooks, and comprehensive monitoring via dashboards and alerts, ensuring clean books, risk mitigation, and efficient finance execution. It fits into the larger system by enabling Finance, Tax & Compliance teams to manage payments, reserves, refunds, chargebacks, promotions, and tax compliance with minimal code changes and strong auditability."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0129.md",
    "size_bytes": 4272,
    "ext": ".md",
    "description": "This document outlines the NT-0129 blueprint for managing tax compliance processes within a larger system, covering W9 onboarding, TIN matching, 1099 generation and filing, and marketplace sales tax nexus tracking. It defines workflows, dashboards, approval guardrails, and exception handling to ensure accurate tax reporting and regulatory adherence. The blueprint integrates tax data management, user consent tracking, and audit controls to support finance and compliance teams in maintaining tax obligations."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0130.md",
    "size_bytes": 4269,
    "ext": ".md",
    "description": "This document outlines the specifications and acceptance criteria for a comprehensive tax management system module that handles tax code mapping, calculation monitoring, exemptions, filing calendars, payments, and reporting. It integrates automated processes with human oversight for approvals, exceptions, and audits, supporting compliance through metrics, alerts, and telemetry. This module fits into the larger system by ensuring accurate tax calculation, filing, and remittance across jurisdictions while providing operational transparency and control."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0131.md",
    "size_bytes": 4263,
    "ext": ".md",
    "description": "This document (NT-0131.md) outlines the blueprint for a no-code control tower system that enables Operations, Marketing, Finance, and Trust & Safety teams to manage and govern paid promotions and marketplace economics. It defines the scope, roles, pricing models, eligibility rules, targeting, safety controls, ranking algorithms, and audit mechanisms to ensure transparent, safe, and effective paid visibility features like search boosts and featured carousels across city tiers. The file fits into the larger system by automating complex promotional workflows while maintaining human oversight, enforcing guardrails, and providing metrics and telemetry for continuous monitoring and adjustment."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0132.md",
    "size_bytes": 4297,
    "ext": ".md",
    "description": "This document outlines the design and operational blueprint for a non-technical system managing paid promotions, including pricing, quality scoring, fraud detection, and budget protection. It details admin UI controls for setting CPC floors, eligibility rules, and experimentation frameworks, as well as measurement, finance integration, alerts, and telemetry to ensure campaign effectiveness and safeguard against abuse. Overall, it serves as a comprehensive guide for configuring, monitoring, and optimizing paid promotional campaigns within a larger advertising platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0133.md",
    "size_bytes": 4311,
    "ext": ".md",
    "description": "This file documents the NT-0133 blueprint, detailing a no-code operational cockpit for city-level market management within a larger platform. It enables City Operations and Marketing teams to set supply targets, seed providers, manage perks, monitor city health via dashboards, and enforce guardrails on budgets and eligibility without code changes. The blueprint integrates fraud controls, pricing and quality safeguards, reporting, and experiment frameworks to ensure fair, efficient, and scalable local market growth."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0134.md",
    "size_bytes": 4285,
    "ext": ".md",
    "description": "This document outlines a comprehensive non-technical blueprint for managing and optimizing a city-based creator and studio platform. It covers key operational areas such as onboarding verified creators, managing perks and budgets, rotating top profiles in city-specific carousels, seeding studios and demand, organizing local events, and running targeted playbooks to address supply gaps and improve response times. The file serves as a strategic guide integrating various system components like CRM imports, financial ledgers, and promotional rules to drive growth and engagement within local creative ecosystems."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0135.md",
    "size_bytes": 4286,
    "ext": ".md",
    "description": "This file documents a non-technical blueprint (NT-0135) outlining the design and operational guidelines for city-level management tools within a larger system. It details integrations with promotions, verification, finance, and support modules, and specifies metrics, alerts, telemetry, and acceptance criteria for features like dashboards, cohort management, perks, rotations, and event builders. The blueprint ensures coordinated, scalable city operations with fair discovery, budget enforcement, and tight cross-team integration, supporting seamless management of contracts, communications, and local events."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0136.md",
    "size_bytes": 4259,
    "ext": ".md",
    "description": "This file documents the NT-0136 blueprint, which defines a comprehensive legal and operational document management system for non-technical workflows. It covers document types, clause libraries, template editing, versioning, approvals, e-signatures, and integration with bookings to ensure compliant, role- and location-aware contract generation and publishing. This system supports controlled publishing, audit trails, and secure record-keeping, fitting into a larger platform that manages talent bookings and related legal agreements."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0137.md",
    "size_bytes": 4261,
    "ext": ".md",
    "description": "This file documents a comprehensive blueprint for managing non-technical legal and communication templates within a larger system, covering contract clauses, dispute macros, email/SMS communications, localization, integrations, governance, metrics, and telemetry. It defines standardized content and workflows for Statements of Work, House Rules, dispute handling, and transactional messaging, ensuring compliance, quality, and operational consistency across bookings and city-specific requirements. Overall, it serves as a central reference for creating, maintaining, and monitoring legal and communication assets that support booking lifecycle and dispute resolution processes."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0138.md",
    "size_bytes": 4238,
    "ext": ".md",
    "description": "This document defines the operational blueprint for managing studio onboarding, verification, and standards within a marketplace system, enabling non-technical teams to enforce policies without code changes. It covers roles, guardrails, compliance checks, house rules, deposit handling, and integrations with booking and communication systems to ensure safe, verified, and policy-compliant studio listings. By providing configurable workflows, approvals, and audit trails, it supports smooth studio operations while maintaining governance, legal compliance, and dispute defensibility."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0139.md",
    "size_bytes": 4256,
    "ext": ".md",
    "description": "This document outlines the operational guidelines and system rules for managing non-technical studio listings within a larger booking platform. It covers amenities, house rules, safety addenda, deposit and damage claim processes, access management, pricing controls, booking group integrations, studio seeding strategies, and compliance requirements. Overall, it serves as a comprehensive blueprint for ensuring standardized studio management, user safety, and smooth financial and operational workflows in the platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0140.md",
    "size_bytes": 4254,
    "ext": ".md",
    "description": "This document outlines the non-technical blueprint for managing verified studio listings within a marketplace, covering outreach, compliance, safety, moderation, metrics, telemetry, and acceptance criteria. It defines processes for onboarding, verification, deposit handling, access control, and city coverage growth, integrating with booking, dispute, and finance systems to ensure trustable supply and smooth operations. Additionally, it specifies data and reporting tools for non-engineering teams to monitor marketplace performance securely and act on curated insights."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0141.md",
    "size_bytes": 4297,
    "ext": ".md",
    "description": "This document defines the specifications and governance for a suite of curated dashboards and reports across multiple non-technical domains such as Moderation, Support, Finance, and Operations. It outlines data sources, metric definitions, access controls, data freshness standards, and quality checks to ensure reliable, secure, and well-documented analytics. These dashboards provide actionable insights through drilldowns, cohort analyses, and alerts, supporting operational decision-making and performance monitoring within the larger organizational analytics ecosystem."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0142.md",
    "size_bytes": 4276,
    "ext": ".md",
    "description": "This document outlines the design and features of a comprehensive non-technical dashboard system used for monitoring key operational, financial, compliance, and product metrics across multiple business domains such as finance, tax, studios operations, and experiments. It details dashboard components including filters, drilldowns, exports, alerts, privacy controls, and integrations, enabling stakeholders to track performance, detect anomalies, and manage data quality within a larger analytics and reporting ecosystem. The file serves as a blueprint for building and maintaining these dashboards with role-based access, data governance, and cross-functional links to related operational tools."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0143.md",
    "size_bytes": 4269,
    "ext": ".md",
    "description": "This document (NT-0143.md) outlines the design and operational guidelines for non-technical dashboards and observability tools within a larger data and service platform. It details data quality metrics, telemetry events, dashboard ownership, and privacy safeguards, as well as defining service-level objectives (SLOs), incident response procedures, and monitoring dashboards to ensure system health and reliability. Overall, it serves as a blueprint for aligning cross-team data insights, maintaining data trust, and enabling rapid detection and resolution of operational issues."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0144.md",
    "size_bytes": 4278,
    "ext": ".md",
    "description": "This document outlines the Health Cockpit system for monitoring and managing the operational health of key platform services via status boards, synthetic user path monitors, and dependency status. It defines alerting policies with severity levels, incident lifecycle procedures including communication and mitigation steps, and detailed degradation and kill switch controls to maintain service continuity during failures. The file serves as a non-technical blueprint guiding incident response, escalation, and recovery processes within the broader platform observability and reliability framework."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0145.md",
    "size_bytes": 4284,
    "ext": ".md",
    "description": "This document defines comprehensive runbooks and operational procedures for managing non-technical incidents across various system components such as Finance, Payouts, Search, Uploads, and Promotions. It outlines safeguards like staged rollouts, logging and tracing policies, backup and recovery targets, incident communication workflows, postmortem processes, and observability metrics to ensure system reliability and transparency. Serving as a key part of the organization's incident management framework, it guides teams in detection, mitigation, communication, and continuous improvement of operational practices."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0146.md",
    "size_bytes": 4270,
    "ext": ".md",
    "description": "This document (NT-0146) defines non-technical operational blueprints for incident management, alerting, runbooks, change safeguards, and bulk data operations within a larger system. It outlines workflows, roles, guardrails, and tooling to ensure safe, auditable, and efficient handling of incidents, large-scale changes, and policy enforcement without code changes. The file serves as a comprehensive guide to support teams for maintaining system reliability, compliance, and continuous improvement through structured processes and automation."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0147.md",
    "size_bytes": 4255,
    "ext": ".md",
    "description": "This document outlines non-technical operational blueprints for managing complex workflows such as user account merges, booking adjustments, bulk financial transactions, and promotional campaign controls within a larger platform. It defines use cases, actions, guardrails, rollback procedures, and communication protocols to ensure data integrity, compliance, and user notification. Serving as a procedural guide, it supports cross-functional teams in executing and monitoring critical system changes safely and consistently."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0148.md",
    "size_bytes": 4253,
    "ext": ".md",
    "description": "This document outlines a comprehensive non-technical blueprint for managing bulk operational jobs such as crediting refunds, reindexing search data, retagging content, updating studio policies, and running impact simulations. It defines standardized procedures, guardrails, scheduling, communication templates, data integrity measures, and metrics/alerts to ensure safe, auditable, and efficient execution of large-scale system changes. This blueprint fits into the larger system as a governance and orchestration framework for complex batch operations affecting finance, content, user data, and external integrations."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0149.md",
    "size_bytes": 4248,
    "ext": ".md",
    "description": "This document outlines the specifications and acceptance criteria for a unified bulk job management system handling non-technical operational tasks such as indexing, money jobs, promotions, and content moderation. It details telemetry, alerts, and safety guardrails to ensure safe, reversible, and scalable batch operations with approvals, monitoring, and rollback capabilities. Additionally, it defines legal and records management processes for handling subpoenas, litigation holds, and data subject requests with strict access controls, audit trails, and compliance safeguards within the broader system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0150.md",
    "size_bytes": 4233,
    "ext": ".md",
    "description": "This document outlines the processes and policies for managing legal and compliance workflows related to subpoenas, legal holds, data retention, data subject requests, and discovery/production within a larger system. It defines metadata standards, SLA timers, scope checks, and automated routing for legal cases, as well as detailed retention schedules, purge mechanisms, and user data access/deletion protocols. Overall, it serves as a blueprint for ensuring lawful data handling, preservation, and disclosure in response to legal and regulatory requirements."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0151.md",
    "size_bytes": 4252,
    "ext": ".md",
    "description": "This document outlines the design and requirements for a legal and records management system focused on data subject requests (DSRs), legal holds, discovery, redaction, and production workflows. It details features such as secure intake and verification, PII-masked preview and tagging, redaction tools, chain of custody with two-person approvals, consent log management, integrations with Trust & Safety, Support, Finance, and document CMS, as well as metrics, alerts, and telemetry for compliance monitoring. The system ensures defensible, practical, and safe handling of sensitive legal data with configurable retention, audit trails, and operational controls to support legal and compliance teams."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0152.md",
    "size_bytes": 4227,
    "ext": ".md",
    "description": "This document defines the design and operational guidelines for a Sandbox & Training environment used by multiple non-technical teams (e.g., Support, Finance, Legal) to safely rehearse workflows and validate processes without impacting production or exposing real PII. It details environment isolation, synthetic and anonymized data strategies, seeded scenario packs for role-based training, and simulators for external dependencies like payments and tax systems. This Sandbox fits into the larger system as a secure, controlled space enabling low-code compliance operations, incident drills, and QA/UAT, ensuring safe and realistic practice while protecting sensitive data."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0153.md",
    "size_bytes": 4256,
    "ext": ".md",
    "description": "This file documents the design and features of a comprehensive sandbox environment used for non-technical training, testing, and quality assurance within a larger system. It details simulators for external dependencies, role-based training curricula with autograding and certifications, incident drills with chaos engineering tools, no-code QA/UAT workflows, and strict guardrails to ensure safety and data privacy. The sandbox supports snapshots, access controls, telemetry, and reporting to measure training effectiveness and system readiness before production deployment."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0154.md",
    "size_bytes": 4281,
    "ext": ".md",
    "description": "This document outlines a comprehensive non-technical blueprint for a sandboxed training and quality assurance environment that uses realistic data simulators, role-based curricula, incident drills, and guarded workflows to ensure safe, privacy-compliant learning and testing across multiple operational domains. It fits into the larger system as a foundational program establishing auditable, privacy-safe data pipelines, event contracts, and layered warehouse schemas that support analytics, compliance, finance, and ML, enabling reliable UAT, training, and operational readiness without impacting production."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0155.md",
    "size_bytes": 4281,
    "ext": ".md",
    "description": "This document defines a comprehensive non-technical blueprint for data event contracts, governance, quality, and operational SLAs within a larger data platform. It specifies standardized event schemas, privacy and retention policies, success metrics, change management processes, and risk mitigations to ensure reliable, auditable, and privacy-compliant data pipelines that support analytics, finance, and ML feature stores. Overall, it aligns cross-functional teams on consistent data language and controls to maintain data integrity, performance, and compliance across the system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0156.md",
    "size_bytes": 4308,
    "ext": ".md",
    "description": "This file defines the event naming conventions, versioning policies, data types, privacy tiers, and core event schemas for non-technical teams to standardize event payloads across the system. It ensures consistent, privacy-compliant telemetry by specifying required fields, allowed values, and rules for Personally Identifiable Information (PII) handling. As part of the larger system, it serves as a blueprint for event data contracts used in analytics, messaging, booking, and other domains."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0157.md",
    "size_bytes": 4384,
    "ext": ".md",
    "description": "This file documents the message blueprints and payload schemas for non-technical workflows related to booking, deliverables, payments, promotions, tax compliance, and trust & safety within a larger service platform. It defines standardized event types and data structures used for interactions such as booking requests, delivery uploads, payment processing, promotional campaigns, tax form submissions, and moderation cases. This serves as a reference for integrating and coordinating various non-technical business processes across the system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0158.md",
    "size_bytes": 4313,
    "ext": ".md",
    "description": "This file defines a comprehensive event schema catalog and guidelines for non-technical teams, detailing standardized event payloads across multiple business domains such as tax, trust & safety, studios, support, documentation, and observability. It establishes rules for event emission, schema validation, backward compatibility, and CI enforcement to ensure consistent, privacy-compliant, and auditable data flows within the larger system. This serves as a reference and contract for producers emitting events to a centralized schema registry, supporting reliable downstream processing and analytics."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0159.md",
    "size_bytes": 4297,
    "ext": ".md",
    "description": "This document defines a comprehensive canonical ID system and entity graph for non-technical stakeholders, ensuring stable, opaque identifiers and consistent relationships across core business entities like bookings, payments, messaging, and promotions. It supports additive schema evolution with CI gating and auditability, enabling reliable data joins, soft deletions, and lifecycle management within a larger marketplace platform. The blueprint ensures data integrity and low-risk changes, facilitating downstream consumer stability for dashboards, finance, and ML systems."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0160.md",
    "size_bytes": 4293,
    "ext": ".md",
    "description": "This document defines the state models, referential integrity rules, and multi-role data structures for non-technical entities like bookings, payouts, studios, and promotion campaigns within a larger booking and payment system. It specifies how entities transition through states, enforce soft deletes and cascades, model user profiles by role, and group related booking legs (LBGs) for unified payment and documentation. Additionally, it outlines indexing strategies, validation rules, and example queries to ensure data consistency and support business intelligence reporting."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0161.md",
    "size_bytes": 4266,
    "ext": ".md",
    "description": "This document (NT-0161) specifies the design and operational blueprint for a non-technical event ingestion and processing pipeline within a larger data analytics system. It defines consistent ID usage, entity relationships, lifecycle states, and data quality rules to ensure reliable, privacy-compliant event collection from multiple producers through a layered architecture (Edge Collector → Event Bus → Bronze/Silver/Gold tables). The file outlines how events flow from clients to analytics-ready tables with strict validation, deduplication, and privacy enforcement, supporting downstream finance, operations, and analytics use cases with timely, accurate data."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0162.md",
    "size_bytes": 4254,
    "ext": ".md",
    "description": "This document outlines the design and operational details of a non-technical data pipeline blueprint focused on ingesting, transforming, and reconciling event and finance data through Bronze, Silver, and Gold data layers. It specifies data quality controls, schema enforcement, PII masking, streaming and batch processing SLAs, and mechanisms for replays and corrections, fitting into a larger system that supports finance close processes and analytics with strong auditability and scalability."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0163.md",
    "size_bytes": 4275,
    "ext": ".md",
    "description": "This document (NT-0163) defines the design and operational guidelines for a multi-layered data pipeline architecture handling non-technical event data. It specifies data partitioning, retention policies, failure handling, security controls, telemetry, and acceptance criteria across Bronze (raw), Silver (enriched), and Gold (curated) warehouse layers, ensuring data freshness, privacy compliance, and cost-effective scalability. It fits into the larger analytics system by enabling reliable, secure, and auditable data flows that support BI dashboards, ML pipelines, and financial reconciliation."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0164.md",
    "size_bytes": 4263,
    "ext": ".md",
    "description": "This document defines the data architecture standards and governance policies for non-technical data pipelines, including naming conventions, privacy zones, role-based access controls, PII handling strategies, data retention rules, partitioning and clustering methods, and mandatory schema contracts for fact and dimension tables. It ensures consistent, secure, and compliant management of data across Bronze, Silver, Gold, and Vault layers within the larger data platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0165.md",
    "size_bytes": 4259,
    "ext": ".md",
    "description": "This document defines the design and operational standards for the organization's Gold data schemas and related data governance layers within a larger data platform. It specifies modeling rules, security controls, data quality, lineage, and performance optimizations to ensure business-ready, auditable, and cost-efficient datasets for analysts, finance, data science, and legal teams. The file outlines how data flows from raw to curated layers with strict access, masking, and retention policies, fitting into the enterprise's governed data ecosystem."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0166.md",
    "size_bytes": 4245,
    "ext": ".md",
    "description": "This file documents the design and schema of a non-technical data warehouse layer (\"gold\" layer) focused on business dimensions and facts related to bookings, payments, payouts, deposits, taxes, and promotions. It outlines Slowly Changing Dimension Type 2 (SCD2) dimension tables and multiple fact tables capturing transactional and lifecycle events for a marketplace platform, supporting analytics on user activity, financial flows, and campaign performance. This specification serves as a reference for data engineers and analysts integrating and querying business metrics within the broader data ecosystem."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0167.md",
    "size_bytes": 4294,
    "ext": ".md",
    "description": "This file documents the schema and data model for a \"gold\" analytics layer focused on non-technical campaign, booking, payment, support, trust & safety, and social media metrics. It defines the grain, keys, columns, join relationships, data quality rules, and acceptance criteria for multiple fact tables that track daily aggregated performance and outcomes across campaigns, bookings, messaging, support cases, and social snapshots. This blueprint serves as a reference for building and validating the core data warehouse layer that supports reporting and analysis in the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0168.md",
    "size_bytes": 4242,
    "ext": ".md",
    "description": "This document defines the data modeling, metric catalog, and semantic layer standards for non-technical teams, specifying canonical business metrics and their precise calculations from core fact tables. It ensures consistent, versioned, and auditable metrics with safe aggregations and joins to support dashboards, alerts, experiments, and ML features across the platform. Overall, it provides a unified, reliable analytics foundation that reflects real workflows and prevents double counting or SQL drift within the larger data ecosystem."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0169.md",
    "size_bytes": 4322,
    "ext": ".md",
    "description": "This file defines and documents key non-technical business metrics and their calculation logic, including data sources, expressions, dimensions, and ownership. It serves as a centralized catalog for metric definitions such as GMV, platform revenue, conversion rates, and advertising effectiveness, supporting consistent measurement and reporting across the organization. Positioned within the documentation blueprints, it guides stakeholders in understanding metric derivations and ensures alignment in analytics and decision-making processes."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0170.md",
    "size_bytes": 4285,
    "ext": ".md",
    "description": "This file documents the design and specifications of a semantic metrics layer for non-technical stakeholders, detailing metric definitions, allowed dimensions, privacy guardrails, APIs, testing, versioning, and governance processes. It serves as a blueprint for implementing consistent, privacy-compliant, and well-governed business metrics within a larger data analytics and reporting system. The document ensures alignment between metric owners, data quality standards, and usage policies across the organization."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0171.md",
    "size_bytes": 4282,
    "ext": ".md",
    "description": "This document defines non-technical project plans and governance for analytics metrics, privacy, and data handling within the system. It outlines SQL queries for key financial metrics like take rate, establishes a semantic layer for consistent metric definitions and PII masking, and enforces strict privacy controls including tokenization, access control, and audit logging. Overall, it ensures reliable, privacy-compliant analytics that support product, operations, and legal requirements in a US-only data residency context."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0172.md",
    "size_bytes": 4255,
    "ext": ".md",
    "description": "This document defines comprehensive privacy, security, and data governance policies for handling sensitive information across environments (Sandbox vs Prod) within the system. It outlines controls for consent management, data retention and deletion, encryption, data loss prevention, ML privacy safeguards, auditing, and incident response to ensure compliance and protect PII throughout data ingestion, storage, access, and usage. Serving as a blueprint, it integrates privacy and security best practices into operational workflows and technical controls to support safe, compliant analytics and data sharing."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0173.md",
    "size_bytes": 4266,
    "ext": ".md",
    "description": "This document defines non-technical policies and procedures related to scheduling, cancellations, refunds, and dispute resolution within a service platform. It outlines flexible and standard refund rules, roles and permissions for changes, and detailed scenarios for handling cancellations, damage claims, and quality disputes. As part of the broader system, it ensures operational clarity, compliance, and fairness between buyers and providers."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0174.md",
    "size_bytes": 4242,
    "ext": ".md",
    "description": "This document (NT-0174.md) outlines dispute resolution scenarios, entity definitions, and data schema details related to non-technical project plans for a service marketplace platform. It defines key business entities (users, bookings, messages, reviews, payments, etc.), their relationships, and rules for handling quality disputes, refunds, and adjustments. The file serves as a reference for data modeling, operational workflows, and audit processes within the larger system managing service bookings, promotions, payments, and support cases."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0175.md",
    "size_bytes": 4315,
    "ext": ".md",
    "description": "This document (NT-0175.md) serves as a non-technical blueprint detailing data governance, privacy classifications, and data quality/testing standards within the system. It outlines data schemas with PII handling, data retention policies, and the layered data pipeline from raw events to business intelligence outputs, ensuring privacy, accuracy, and auditability. This file supports compliance and operational integrity by defining how sensitive data is managed and validated across the organization's analytics infrastructure."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0176.md",
    "size_bytes": 4306,
    "ext": ".md",
    "description": "This document defines a comprehensive data quality testing framework for a multi-layered data pipeline, covering contract validation, referential integrity, business rules, financial reconciliations, freshness, privacy, anomaly detection, and metric consistency. It specifies test categories, severity levels, gating rules, ownership, and scheduling to ensure data reliability from ingestion through semantic layers and BI exports. This blueprint guides cross-team responsibilities and automated checks that gate critical processes like finance close and payouts within the larger data platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0177.md",
    "size_bytes": 4286,
    "ext": ".md",
    "description": "This document outlines the data quality (DQ) framework and operational procedures for non-technical teams, focusing on finance, analytics, and privacy domains. It defines schedules for data freshness checks, semantic and invariant tests on key financial tables, quarantine and replay processes for error handling, and monitoring dashboards with alerts to ensure data reliability. The file supports maintaining trust and accuracy in financial reporting and analytics by providing clear gates, runbooks, and audit trails integrated into the broader data pipeline and governance system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0178.md",
    "size_bytes": 4259,
    "ext": ".md",
    "description": "This document defines the policies, tools, and workflows for replaying and backfilling event data within a data pipeline to ensure accurate, idempotent analytics and finance reporting. It covers event replay mechanics, backfill job management, impact scoping via lineage, idempotency guarantees, slowly changing dimension (SCD2) rebuilds, and handling of finance reclose adjustments. As part of the larger data system, it ensures data correctness, auditability, and compliance during data corrections, reprocessing, and financial close operations."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0179.md",
    "size_bytes": 4254,
    "ext": ".md",
    "description": "This document defines the design and operational guidelines for a financial data backfill and replay system within a larger data warehouse environment. It details how preclose and postclose financial facts are handled, including adjustments, privacy and compliance controls, performance throttling, QA processes, telemetry, and signoff requirements to ensure data accuracy, auditability, and regulatory adherence. The system integrates with external payment and tax services, providing traceable, idempotent, and controlled data corrections that maintain historical integrity and support finance and product teams."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0180.md",
    "size_bytes": 4293,
    "ext": ".md",
    "description": "This document outlines the design and integration patterns for non-technical system adapters used in a US-only launch, covering key domains like payments, tax calculation, identity verification, background checks, communications, and content safety. It defines adapter responsibilities, event flows, security measures, and data handling standards to ensure consistent, auditable interactions with external vendors and services. As part of a larger system, it standardizes how external APIs and webhooks are consumed and normalized into internal event streams for downstream processing and reconciliation."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0181.md",
    "size_bytes": 4312,
    "ext": ".md",
    "description": "This document outlines the design and operational details of various non-technical system adapters and connectors within a larger platform, including background checks, social media analytics, content safety scanning, e-signatures, communications, storage, and financial lineage tracking. It specifies data flows, compliance and privacy policies, emitted events, security measures, telemetry, and monitoring practices to ensure secure, compliant, and reliable integration with external services. Overall, it serves as a blueprint for managing external integrations, data handling, and system observability in support of core business workflows."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0182.md",
    "size_bytes": 4256,
    "ext": ".md",
    "description": "This document (NT-0182.md) outlines the design and acceptance criteria for external system adapters handling non-technical integrations such as webhooks, polling, and API syncs, ensuring secure, auditable, and versioned data flows. It defines how external references and events are tracked end-to-end for financial reconciliation, content safety, and operational trust, with strong security and monitoring practices to maintain compliance and reliability. Additionally, it previews the next section on ML feature stores and modeling hooks that support ranking, risk assessment, and automation with privacy-safe, auditable machine learning pipelines integrated into the broader system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0183.md",
    "size_bytes": 4262,
    "ext": ".md",
    "description": "This document defines the design and specifications for a non-technical blueprint focused on feature engineering, model training, and inference for a marketplace system. It details feature groups, data schemas, training datasets and labels, model registry and evaluation, as well as inference API contracts and performance SLOs. Overall, it serves as a comprehensive guide for building and maintaining machine learning components that support ranking, risk assessment, and promotion quality in the larger platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0184.md",
    "size_bytes": 4261,
    "ext": ".md",
    "description": "This document (NT-0184) outlines the design and operational blueprint for a non-technical project component focused on a search ranking and promotion system integrated with machine learning models. It details system responsibilities including candidate retrieval, feature fetching, ranking with fairness and safety guardrails, fallback heuristics, promotion scoring, risk routing, logging, monitoring for model drift, and experimentation frameworks. The file situates this component within a larger ecosystem emphasizing governance, human oversight, performance SLOs, cost controls, and safe ML deployment practices to ensure reliable, fair, and efficient discovery and ordering experiences."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0185.md",
    "size_bytes": 4278,
    "ext": ".md",
    "description": "This document outlines the operational principles, service level objectives (SLOs), budgeting, access controls, compute scheduling, materialization strategies, monitoring, governance, and user experience guidelines for managing data freshness, cost, and query efficiency in a non-technical ops context. It defines policies and tooling to ensure data accuracy and freshness, enforce cost and resource budgets, and provide visibility and self-service capabilities to teams, fitting into a larger system of data platform governance and operational reliability."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0186.md",
    "size_bytes": 4270,
    "ext": ".md",
    "description": "This document outlines telemetry, cost and freshness monitoring, and error budget enforcement for data queries and compute resources, ensuring predictable data freshness and cost controls within guardrails. It also specifies an experimentation platform supporting various A/B test types with deterministic assignment, exposure logging, and safety guardrails, integrating tightly with a semantic metrics catalog. Together, these components enable stable, cost-effective data operations and trustworthy causal measurement within the larger data and experimentation ecosystem."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0187.md",
    "size_bytes": 4265,
    "ext": ".md",
    "description": "This document outlines the design, implementation, and analysis framework for non-technical A/B and other experimental tests within a marketplace system, focusing on buyer and provider metrics. It details experiment types, guardrails, statistical methods, analysis pipelines, interference controls, and ethical policies to ensure robust, fair, and safe experimentation. As part of the larger experimentation infrastructure, it guides how experiments are planned, monitored, analyzed, and reported to optimize product decisions while maintaining system integrity."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0188.md",
    "size_bytes": 4253,
    "ext": ".md",
    "description": "This document outlines the ethical guidelines, telemetry event schemas, acceptance criteria, and foundational scope for a non-technical project phase focused on launching a safe, auditable, and feature-flagged single-leg booking experience. It details experiment design and monitoring frameworks, guardrails for fairness and safety, and core platform features such as user roles, search, booking, messaging, payments, and ID verification. Serving as a blueprint, it ensures that the system respects marketplace dynamics while enabling reproducible, trustworthy experimentation and phased product rollout."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0189.md",
    "size_bytes": 4276,
    "ext": ".md",
    "description": "This document outlines the specifications and acceptance criteria for the initial non-technical project blueprint NT-0189, covering core features like ID verification, payments, booking, messaging, and admin support. It defines phased deliverables including user profiles, search filters, escrow booking flows, refund policies, and finance close processes, serving as a foundational plan for implementing and testing these functionalities within the larger system. The file acts as a comprehensive guide for development, QA, and stakeholder alignment on feature scope and operational workflows."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0190.md",
    "size_bytes": 4279,
    "ext": ".md",
    "description": "This document outlines the project plan and feature specifications for a non-technical system supporting booking, messaging, finance, trust, and support workflows within a larger platform. It details a four-week development timeline with parallel tracks for building core functionalities like authentication, booking, payments, admin actions, and analytics, along with operational runbooks and feature flags. The file serves as a blueprint guiding implementation, testing, and alpha demonstration of key user and admin capabilities, ensuring auditability, safety, and compliance."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0191.md",
    "size_bytes": 4270,
    "ext": ".md",
    "description": "This document outlines the Phase0 and Phase1 plans for a non-technical project related to booking Houston photographers, detailing workflows for instant booking, escrow handling, change orders, payouts, and admin operations. It defines acceptance criteria, risk mitigations, and scope boundaries for a safe, auditable booking and payout system, while setting the foundation for future features like promotions, ACH payments, social search, and reputation scoring. The file serves as a blueprint guiding development, testing, and rollout phases within the larger platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0192.md",
    "size_bytes": 4258,
    "ext": ".md",
    "description": "This document outlines the specifications, deliverables, and acceptance criteria for various non-technical features and operational workflows within a platform, including reputation scoring, Trusted Pro background checks, boards & favorites management, profile posts, change orders, tax engine integration, payments, promotions, and admin support tools. It serves as a blueprint for implementing and validating these interconnected components that enhance user trust, search relevance, payment processing, and administrative control in the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0193.md",
    "size_bytes": 4296,
    "ext": ".md",
    "description": "This document outlines the planning and operational details for a non-technical project beta rollout focused on promotions, payments (ACH), social integrations, background checks, tax engine, and related admin tools. It defines feature flags, timelines, data quality metrics, growth and safety guardrails, runbooks, KPIs for beta exit criteria, and risk mitigations. Serving as a comprehensive blueprint, it guides cross-functional teams in implementing, monitoring, and iterating key platform features to ensure a controlled and measurable beta launch within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0194.md",
    "size_bytes": 4250,
    "ext": ".md",
    "description": "This document outlines the project plan and acceptance criteria for a non-technical system upgrade focused on improving marketplace trust, payment options, promotions, and engagement features. It details phased deliverables such as ACH payment rollout, verified social metrics, background checks, tax calculation enhancements, and a unified booking flow combining talent and studio reservations. Serving as a blueprint, it guides development and operational teams through feature scope, testing, and rollout strategies to achieve a reliable, scalable, and user-trusted platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0195.md",
    "size_bytes": 4259,
    "ext": ".md",
    "description": "This document outlines the design and rollout plan for a suite of non-technical platform features including booking group (LBG) scheduling and allocations, a studios marketplace with profiles and deposits, early payout options, promotions, tax engine expansion, and an experimentation platform with an ML ranker. It details feature responsibilities, eligibility rules, audit and compliance guardrails, rollout timelines, feature flags, and data quality metrics, serving as a comprehensive blueprint for coordinated development, deployment, and monitoring within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0196.md",
    "size_bytes": 4280,
    "ext": ".md",
    "description": "This document outlines the launch plan and operational framework for a major General Availability (GA) release expanding analytics, data quality, payments, promotions, tax, and ranking systems in a non-technical project. It defines key performance indicators, risk mitigations, acceptance criteria, and runbooks to ensure smooth rollout and governance of features like LBG checkout, studios marketplace, early payouts, and tax compliance. Serving as a comprehensive blueprint, it guides cross-functional teams in delivering a unified talent-and-space platform with robust controls and measurable business impact."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0197.md",
    "size_bytes": 4257,
    "ext": ".md",
    "description": "This file documents the admin tools and operational controls for managing LBG timelines, deposits, promotions, and tax configurations within a larger system, ensuring all actions are audited and KPIs are met. It outlines layered data quality checks, severity levels for issues, and remediation workflows across different data engineering and product teams to maintain data integrity and system reliability. Additionally, it describes SLA monitoring and failover strategies for critical adapters, supporting scalable city-by-city monetization with built-in safety and rollback mechanisms."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0198.md",
    "size_bytes": 4280,
    "ext": ".md",
    "description": "This file is a non-technical blueprint document outlining operational service level objectives (SLOs), resource caps, and workload priorities for various data products and teams within a US-based creative marketplace platform. It defines data freshness targets, compute and storage quotas, external call limits, and concurrency rules to ensure reliable, efficient, and prioritized processing of marketplace, finance, and analytics workloads. Additionally, it includes organizational principles and plans related to hiring and on-call responsibilities, supporting safe and aligned product delivery across multiple business functions."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0199.md",
    "size_bytes": 4290,
    "ext": ".md",
    "description": "This document defines organizational principles, processes, and operational responsibilities for safely and efficiently shipping features in a trust-sensitive marketplace. It emphasizes cross-functional squads aligned by value streams, use of feature flags, admin tooling, audit trails, and rigorous risk reviews to manage money, safety, and policy-sensitive flows. The file fits into the larger system as a blueprint for coordinating product, trust, finance, and support teams to ensure reliable, compliant, and measurable feature rollouts."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0200.md",
    "size_bytes": 4257,
    "ext": ".md",
    "description": "This document provides detailed deep dives into various non-technical operational scenarios, outlining detection signals, decision trees, admin actions, and roll-forward/roll-back conditions. It includes user-facing copy, telemetry events, and key metrics to monitor interventions, along with anti-patterns to avoid and guardrails to enforce. Serving as a comprehensive reference, it supports consistent execution and monitoring of non-technical processes within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0201.md",
    "size_bytes": 4330,
    "ext": ".md",
    "description": "This document outlines key implementation guardrails and best practices for non-technical processes, focusing on data contracts, feature flag management, admin operability, experimentation protocols, fairness, security, and phased rollouts. It serves as a guideline to ensure consistency, safety, and accountability across system changes, fitting into the larger system by enforcing standards that prevent anti-patterns and support reliable, measurable operations."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0202.md",
    "size_bytes": 4329,
    "ext": ".md",
    "description": "This document outlines key operational principles and implementation guidelines for managing non-technical processes within the system, emphasizing data contracts, feature flagging, admin operability, experimentation, fairness, security, and phased rollouts. It ensures that every process has clear ownership, monitoring dashboards, and mechanisms for revision or retirement, supporting robust governance and continuous improvement. As part of the larger system, it provides a framework to maintain reliability, security, and fairness in process execution and feature deployment."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0203.md",
    "size_bytes": 4328,
    "ext": ".md",
    "description": "This document outlines operational and implementation guidelines for launching and scaling a US-only creative marketplace focused on models, photographers, and content creators. It details processes for data management, feature flagging, security, experimentation, and city-by-city rollout, while also defining team structures and ownership to ensure trust, safety, and efficient scaling. Serving as a blueprint, it connects business decisions with organizational execution to maintain control and adaptability in a sensitive marketplace environment."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0204.md",
    "size_bytes": 4285,
    "ext": ".md",
    "description": "This document defines the operational principles, team structures, processes, and success metrics for managing non-technical functions related to trust, safety, money, and tax within a marketplace platform. It establishes clear roles, workflows, and risk mitigations to ensure reliable execution and policy compliance across organizational phases. The file also includes detailed case studies illustrating how admin tools and feature flags support safe, auditable interventions in real-world scenarios."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0205.md",
    "size_bytes": 4257,
    "ext": ".md",
    "description": "This document provides detailed scenario-based deep dives into various non-technical operational interventions, outlining detection signals, decision trees, admin actions, user communications, telemetry events, and key metrics. It serves as a comprehensive guide for managing and preventing recurrence of issues through defined guardrails, anti-pattern avoidance, and operational playbooks. As part of the larger system, it supports support teams and administrators in handling edge cases and ensuring smooth, controlled responses to complex non-technical challenges."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0206.md",
    "size_bytes": 4330,
    "ext": ".md",
    "description": "This document outlines operational and governance best practices for managing feature flags, experimentation, security, and rollout procedures within the system. It defines protocols for admin operability, fairness, city-by-city gating of risky changes, and data contract management to ensure controlled, secure, and measurable deployments. Serving as a non-technical blueprint, it guides support and admin teams in maintaining system integrity and accountability throughout feature releases and experiments."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0207.md",
    "size_bytes": 4329,
    "ext": ".md",
    "description": "This document outlines operational best practices and implementation guidelines for managing feature flags, experimentation, security, fairness, and rollout strategies within the system. It ensures controlled releases through city gating, enforces strict admin operability and approval processes, and emphasizes data contract versioning to avoid raw webhook coupling. Serving as a non-technical blueprint, it guides cross-functional teams in maintaining system reliability, security, and fairness while enabling iterative experimentation and controlled feature deployment."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0208.md",
    "size_bytes": 4320,
    "ext": ".md",
    "description": "This document outlines operational and implementation guidelines for launching and managing a US-only creative marketplace focused on models, photographers, and content creators. It details key principles such as feature flag versioning, admin operability, experimentation protocols, fairness, security, and phased city-by-city rollouts, ensuring controlled risk and compliance. Additionally, it covers headcount planning aligned with business milestones to maintain organizational clarity and scalable execution within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0209.md",
    "size_bytes": 4277,
    "ext": ".md",
    "description": "This document outlines the operating principles, processes, and success metrics for non-technical teams organized by value streams, emphasizing safe feature launches, audit trails, and cross-functional coordination. It includes detailed case studies and scenarios illustrating how teams handle incidents, policy changes, and abuse prevention using feature flags, admin tools, and defined guardrails. Serving as a blueprint, it guides team structure, risk management, and operational cadences to ensure consistent growth and support within the larger organizational system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0210.md",
    "size_bytes": 4265,
    "ext": ".md",
    "description": "This document provides detailed non-technical deep dives into various operational scenarios, outlining detection signals, decision trees, admin actions, user-facing messaging, telemetry events, and key metrics. It also specifies anti-patterns to avoid and guardrails to ensure safe and consistent interventions. As part of the larger system, it supports cross-functional teams by documenting implementation notes on data contracts, feature flags, admin operability, experimentation protocols, and fairness considerations to guide reliable and compliant feature rollouts."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0211.md",
    "size_bytes": 4326,
    "ext": ".md",
    "description": "This document outlines the governance and implementation guidelines for user-visible ranking, pricing hints, and promotions ordering changes within the system. It emphasizes fairness, security, experimentation via A/B testing, city-by-city rollout of risky changes, and operational controls such as feature flagging and admin operability. Serving as a non-technical blueprint, it ensures that these processes are managed with clear ownership, measurable metrics, and compliance to data and security standards within the larger platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0212.md",
    "size_bytes": 4328,
    "ext": ".md",
    "description": "This document outlines the governance and operational principles for managing non-technical processes related to user-facing features such as ranking, pricing, and promotions. It emphasizes experimentation through controlled A/B testing, fairness by avoiding protected attributes, security via least-privilege access and audit trails, and phased city-by-city rollouts for risky changes. Additionally, it defines implementation best practices including data contracts, feature flag management, and ensuring admin operability, fitting into the larger system as a blueprint for safe, fair, and measurable feature deployment and process ownership."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0213.md",
    "size_bytes": 4320,
    "ext": ".md",
    "description": "This document outlines operational principles, security, fairness, and experimentation guidelines for launching and managing a US-based creative marketplace platform. It details processes such as bias-aware hiring, feature flagging, city-by-city rollouts, and admin operability to ensure trust, safety, and scalable growth. As a non-technical blueprint, it provides organizational clarity and governance to support engineering and product teams in executing and maintaining the marketplace."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0214.md",
    "size_bytes": 4281,
    "ext": ".md",
    "description": "This document outlines operational themes, processes, and risk management practices for non-technical teams, emphasizing safe feature launches, audit trails, and measurable outcomes. It includes detailed case studies demonstrating how cross-functional teams use feature flags, admin tools, and decision frameworks to handle incidents and policy changes without code modifications. Serving as a blueprint, it guides coordination, risk review, and success metrics within the broader organizational system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0215.md",
    "size_bytes": 4271,
    "ext": ".md",
    "description": "This document provides detailed scenario-based deep dives into various non-technical operational processes, such as refund handling, content safety overrides, tax outages, on-call handoffs, and city-based gating. It outlines detection signals, decision trees, admin actions, user communications, telemetry events, and metrics, along with anti-patterns and guardrails to ensure robust and repeatable interventions. As part of the larger system, it serves as a comprehensive reference for support and admin teams to manage edge cases, maintain operational security, and enforce data and feature governance."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0216.md",
    "size_bytes": 4327,
    "ext": ".md",
    "description": "This document outlines the governance and operational principles for managing non-technical processes related to admin roles, security, experimentation, and feature rollout within the system. It emphasizes data contracts, feature flag management, security best practices like least-privilege access and PII masking, and controlled city-by-city deployment of risky changes. Serving as a blueprint, it ensures accountability, fairness, and risk mitigation across administrative and promotional workflows in the larger platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0217.md",
    "size_bytes": 4329,
    "ext": ".md",
    "description": "This document outlines the governance and operational principles for managing non-technical processes related to admin roles, security, experimentation, and feature rollout within the system. It emphasizes least-privilege access control, data privacy, controlled city-by-city feature deployment, and rigorous process ownership with dashboards and revision mechanisms. Serving as a blueprint, it ensures consistent, secure, and measurable management of sensitive actions and changes across the larger platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0218.md",
    "size_bytes": 4338,
    "ext": ".md",
    "description": "This document outlines onboarding playbooks and operational guidelines for launching a US-only creative marketplace, focusing on roles across engineering, product, operations, and support. It details security practices, city-by-city feature rollouts, experiment ethics, and admin tooling to ensure safe, compliant, and efficient marketplace operations. Serving as a key operational manual, it helps new hires quickly integrate while maintaining trust, safety, and financial controls within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0219.md",
    "size_bytes": 4274,
    "ext": ".md",
    "description": "This document outlines non-technical operational playbooks, processes, and success metrics for various roles such as Engineering, Product Management, Design, Support, Trust, and Finance. It details regular business rituals, risk reviews, incident post-mortems, and launch checklists to ensure safe and compliant changes, supported by deep-dive case studies illustrating real-world scenarios and guardrails. Serving as a comprehensive guide, it helps coordinate cross-functional teams in managing feature flags, policy changes, and incident responses within the larger organizational system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0220.md",
    "size_bytes": 4283,
    "ext": ".md",
    "description": "This document provides detailed operational playbooks for handling various non-technical incident scenarios, including detection signals, decision trees, admin actions, and post-intervention metrics. It outlines guardrails, anti-patterns to avoid, and implementation notes covering data contracts, feature flags, admin operability, experimentation, fairness, security, and city-by-city rollout strategies. Serving as a comprehensive guide, it supports support teams and administrators in managing incidents reliably and consistently within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0221.md",
    "size_bytes": 4334,
    "ext": ".md",
    "description": "This document outlines key implementation guidelines and operational best practices for non-technical processes, focusing on data contracts, feature flag management, admin operability, experimentation protocols, fairness, security, and phased rollouts. It ensures robust governance and risk mitigation for changes affecting user-facing features and financial operations within the larger system. The file serves as a blueprint to maintain system integrity, compliance, and continuous improvement through clear ownership and measurable acceptance criteria."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0222.md",
    "size_bytes": 4334,
    "ext": ".md",
    "description": "This document outlines key implementation guidelines and operational best practices for managing non-technical processes within the system, focusing on data contracts, feature flagging, admin operability, experimentation, fairness, security, and phased rollouts. It ensures robust governance through versioning, approval workflows, and measurable acceptance criteria, fitting into the larger system by providing a structured framework to maintain reliability, compliance, and continuous improvement of non-technical features and processes."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0223.md",
    "size_bytes": 4330,
    "ext": ".md",
    "description": "This document outlines operational guidelines and governance for launching and managing a US-only creative marketplace, focusing on roles, incident management, feature flagging, and city-by-city rollouts. It establishes clear on-call rotations, severity levels, and processes to ensure safety, trust, and financial integrity, integrating with broader business policies and technical data contracts. Serving as a non-technical blueprint, it ensures organizational clarity and repeatable procedures to support scalable, secure marketplace operations."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0224.md",
    "size_bytes": 4263,
    "ext": ".md",
    "description": "This document outlines non-technical operational procedures and incident response playbooks for managing policy changes, money movement, and public content rules. It includes success metrics, risk mitigations, launch checklists, and detailed case studies illustrating detection signals, decision trees, admin actions, and rollback conditions for various scenarios. Serving as a reference for cross-functional teams, it supports safe and consistent execution of interventions within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0225.md",
    "size_bytes": 4290,
    "ext": ".md",
    "description": "This document details non-technical operational blueprints for handling specific scenarios such as tax outages, messaging degradation, and city-based feature gating. It outlines detection signals, decision trees, admin actions, roll-forward/roll-back conditions, and associated telemetry and metrics to ensure robust intervention and prevention of recurrence. Additionally, it covers implementation guidelines around data contracts, feature flags, admin operability, experimentation, fairness, security, and phased rollouts, serving as a comprehensive reference for support and operational teams within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0226.md",
    "size_bytes": 4324,
    "ext": ".md",
    "description": "This document outlines operational best practices and implementation guidelines for non-technical processes related to experimentation, fairness, security, and feature rollout within the system. It emphasizes controlled experimentation via A/B testing, strict security and privacy measures, city-by-city gated releases, and robust admin operability with clear ownership and monitoring. Serving as a blueprint, it ensures consistent, secure, and fair management of user-facing features and administrative actions in the larger platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0227.md",
    "size_bytes": 4324,
    "ext": ".md",
    "description": "This document outlines operational and implementation guidelines for non-technical project surfaces, focusing on support readiness, experimentation protocols, fairness, security, and phased rollouts. It defines standards for data contracts, feature flag management, admin operability, and risk mitigation to ensure reliable, fair, and secure system changes. As part of the larger system, it serves as a blueprint to govern safe and measurable deployment of user-facing features and administrative controls."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0228.md",
    "size_bytes": 4305,
    "ext": ".md",
    "description": "This document outlines operational guidelines and vendor management practices for launching a US-only creative marketplace focused on models, photographers, and content creators. It details principles for experimentation, fairness, security, city-by-city rollouts, and close-the-loop processes to ensure trust, safety, and reliability. Serving as a non-technical blueprint, it establishes organizational clarity, SLAs, escalation procedures, and success metrics that support the marketplace’s scalable and compliant growth within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0229.md",
    "size_bytes": 4251,
    "ext": ".md",
    "description": "This document provides detailed case studies and scenario deep dives for non-technical teams, outlining detection signals, decision trees, admin actions, and roll-forward/roll-back conditions for various operational incidents. It serves as a playbook for managing incidents safely and effectively, including user communication, telemetry monitoring, and guardrails to prevent recurrence. Positioned within the larger system, it supports cross-functional coordination and operational readiness through documented best practices and escalation procedures."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0230.md",
    "size_bytes": 4296,
    "ext": ".md",
    "description": "This document outlines detailed operational playbooks and implementation guidelines for non-technical interventions such as messaging degradation, city-specific promotions gating, and daily reconciliations. It defines detection signals, decision trees, admin actions, telemetry, and metrics, while emphasizing safeguards like feature flags, data contracts, security, fairness, and phased rollouts. Serving as a comprehensive reference, it ensures consistent, secure, and measurable execution of non-technical processes within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0231.md",
    "size_bytes": 4327,
    "ext": ".md",
    "description": "This document outlines the governance and operational best practices for managing non-technical processes related to admin roles, security, experimentation, and feature rollout within the system. It emphasizes secure role-based access control, data contract versioning, controlled feature flag deployment, city-by-city risk gating, and continuous process ownership with dashboards to ensure accountability and iterative improvement. This blueprint fits into the larger system by defining standards and controls that ensure safe, fair, and measurable administration of sensitive business operations and feature changes."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0232.md",
    "size_bytes": 4332,
    "ext": ".md",
    "description": "This document outlines the security, operational, and rollout policies for non-technical processes related to admin roles, data handling, and feature deployment within the system. It emphasizes least-privilege access, data privacy, controlled city-by-city feature rollouts, and rigorous experimentation with fairness safeguards. Serving as a governance blueprint, it ensures processes have clear ownership, monitoring, and mechanisms for continuous improvement in the larger organizational framework."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0233.md",
    "size_bytes": 4309,
    "ext": ".md",
    "description": "This document outlines the operational framework and strategic guidelines for launching and managing a US-only creative marketplace focused on models, photographers, and content creators. It details key business decisions, security and safety protocols, team structures, risk management processes, and success metrics to ensure controlled, measurable growth with strong auditability and policy compliance. Serving as a non-technical blueprint, it supports cross-functional teams by defining roles, workflows, and governance necessary for safe and scalable marketplace operations."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0234.md",
    "size_bytes": 4248,
    "ext": ".md",
    "description": "This document provides detailed deep dives into various non-technical intervention scenarios, outlining detection signals, decision trees, admin actions, and roll-forward/roll-back conditions. It includes user-facing copy, telemetry events, key metrics, anti-patterns to avoid, and guardrails to prevent issue recurrence. Serving as a reference for cross-team coordination, it supports operational consistency and risk mitigation within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0235.md",
    "size_bytes": 4310,
    "ext": ".md",
    "description": "This document outlines detailed operational playbooks and intervention scenarios for non-technical processes, including detection signals, decision trees, admin actions, and rollback conditions. It establishes key implementation guidelines around data contracts, feature flag management, admin operability, experimentation, fairness, security, and phased city-by-city rollouts. Serving as a governance and process reference, it ensures consistent, secure, and measurable execution of interventions within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0236.md",
    "size_bytes": 4330,
    "ext": ".md",
    "description": "This document outlines the implementation guidelines and operational best practices for managing non-technical processes related to event data handling, feature flagging, experimentation, security, and rollout strategies within the larger system. It ensures data integrity through versioned schemas, enforces strict admin controls and fairness policies, and mandates phased city-by-city deployments with measurable acceptance criteria. Overall, it serves as a governance blueprint to maintain reliability, security, and fairness in system changes and feature releases."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0237.md",
    "size_bytes": 4322,
    "ext": ".md",
    "description": "This document outlines the implementation guidelines and operational best practices for managing feature releases, data contracts, security, experimentation, and fairness in a non-technical project context. It ensures controlled rollouts, admin operability, and continuous process ownership with dashboards and revision mechanisms, fitting into the larger system by providing governance and risk mitigation frameworks for feature and data management."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0238.md",
    "size_bytes": 4295,
    "ext": ".md",
    "description": "This document outlines the performance, growth, and training frameworks for a US-based creative marketplace, detailing organizational roles, processes, and operational principles to ensure safe, measurable, and scalable execution. It defines career ladders, team structures, review cadences, and risk management practices that support trust-sensitive features involving identity, payments, and content safety. Serving as a blueprint, it guides internal clarity and repeatable processes critical for launching and scaling marketplace features city-by-city with strong admin tooling and audit trails."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0239.md",
    "size_bytes": 4247,
    "ext": ".md",
    "description": "This document provides detailed scenario-based deep dives into various non-technical operational incidents, outlining detection signals, decision trees, admin actions, and roll-forward/roll-back conditions. It serves as a comprehensive playbook for coordinating cross-team responses, including user communication, telemetry monitoring, and prevention guardrails. As part of the larger system, it supports consistent and effective incident management and mitigation across finance, support, trust, and other teams."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0240.md",
    "size_bytes": 4315,
    "ext": ".md",
    "description": "This document outlines the detailed operational blueprint for managing non-technical interventions such as promotions, tax changes, and support staffing in a city-by-city rollout. It specifies decision trees, admin actions, telemetry, metrics, and guardrails to ensure controlled, secure, and fair execution, including feature flag management, experimentation protocols, and security measures. As part of a larger system, it ensures reliable, auditable, and iterative deployment of business-critical changes with clear ownership and monitoring."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0241.md",
    "size_bytes": 4327,
    "ext": ".md",
    "description": "This document outlines operational and implementation guidelines for non-technical processes related to admin configurations, experimentation, security, and rollout strategies within the system. It defines standards for feature flag management, data contracts, fairness in modeling, and city-by-city gated releases to ensure controlled, secure, and fair deployment of changes. Serving as a blueprint, it ensures consistent governance and risk mitigation across administrative and promotional operations in the larger platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0242.md",
    "size_bytes": 4330,
    "ext": ".md",
    "description": "This document outlines operational and security guidelines for launching and managing a US-based creative marketplace platform, focusing on fairness, experimentation, and risk management. It defines protocols for admin controls, feature flagging, data contracts, and city-by-city rollout of risky changes, ensuring secure, measurable, and equitable platform operations. As part of the broader system, it supports governance and compliance for marketplace features involving models, photographers, and studios."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0243.md",
    "size_bytes": 4303,
    "ext": ".md",
    "description": "This document defines the operational blueprint for a trust-sensitive marketplace serving models, photographers, videographers, and content creators, detailing business policies, team structures, processes, and risk mitigations. It establishes clear roles, workflows, and audit requirements to ensure safe, compliant, and scalable execution of features like Instant Book and ACH payments, supporting city-by-city market launches. As part of the broader system, it guides organizational clarity and repeatable processes critical to managing identity, money, and creative safety within the platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0244.md",
    "size_bytes": 4248,
    "ext": ".md",
    "description": "This document provides detailed deep dives into various non-technical intervention scenarios, outlining detection signals, decision trees, admin actions, and roll-forward/roll-back conditions. It also includes user-facing copy, telemetry events, key metrics, anti-patterns to avoid, and guardrails to prevent issue recurrence. Serving as a comprehensive reference, it supports operational teams in managing and mitigating risks across different trust and safety, billing, and support workflows within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0245.md",
    "size_bytes": 4314,
    "ext": ".md",
    "description": "This document outlines the operational and implementation guidelines for managing city-by-city feature rollouts, including promotions, tax expansions, and support staffing. It details the detection signals, decision trees, admin actions, and metrics used to monitor interventions, emphasizing data contracts, feature flagging, security, fairness, and experimentation practices. Serving as a non-technical blueprint, it ensures controlled, measurable, and secure deployment processes within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0246.md",
    "size_bytes": 4326,
    "ext": ".md",
    "description": "This document outlines the non-technical blueprint for implementing fair, secure, and measurable processes related to promotions, pricing, and seller exposure within the system. It defines key operational principles such as fairness (avoiding protected attributes), security (RBAC, PII masking, audits), city-by-city rollout gating, and rigorous experimentation with pre-registered metrics. The file serves as a governance and implementation guide ensuring consistent data contracts, feature flag management, admin operability, and closed-loop process ownership within the larger platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0247.md",
    "size_bytes": 4324,
    "ext": ".md",
    "description": "This document serves as a detailed internal blueprint outlining policies, processes, and implementation guidelines for launching and operating a US-only creative marketplace platform. It covers key areas such as experimentation protocols, fairness and security postures, city-by-city rollout strategies, data contracts, feature flag management, and compliance risk posture. As part of the larger system, it ensures that product, operations, and legal teams align on controlled, secure, and fair deployment practices with clear ownership and monitoring mechanisms."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0248.md",
    "size_bytes": 4321,
    "ext": ".md",
    "description": "This document defines the legal, policy, and operational framework for launching and managing a US-only creative marketplace platform focused on artistic nudity content. It establishes rules around user eligibility, content standards, payments, privacy, safety, and enforcement, while outlining procedures for policy changes, incident handling, and compliance. Serving as a foundational blueprint, it guides cross-functional teams in ensuring lawful, safe, and fair platform operations during a phased city-by-city rollout."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0249.md",
    "size_bytes": 4263,
    "ext": ".md",
    "description": "This document defines non-technical policies and procedures related to data privacy, compliance, risk mitigation, and dispute handling within the organization. It provides templates, audit metrics, and detailed scenario-based workflows to guide operational and legal teams in managing issues like chargebacks, DMCA notices, emergency disclosures, and accessibility complaints. As part of the broader compliance and governance framework, it ensures consistent, auditable, and legally vetted processes for internal and external stakeholder interactions."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0250.md",
    "size_bytes": 4260,
    "ext": ".md",
    "description": "This document outlines non-technical operational blueprints for handling various compliance and dispute scenarios such as accessibility complaints, anti-discrimination reports, and chargebacks. It details intake procedures, decision trees, admin actions, audit requirements, and communication guidelines while emphasizing legal risk management and evidence integrity. The file serves as a reference for cross-functional teams to implement consistent, auditable processes supported by feature flags, admin tools, training, and performance measurement within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0251.md",
    "size_bytes": 4277,
    "ext": ".md",
    "description": "This document outlines the implementation guidelines for non-technical policy management within the system, focusing on admin operability, evidence handling, communication clarity, training, and measurement. It details how policy toggles are controlled via feature flags with audit trails and rollback capabilities, ensuring secure and compliant administration. This file serves as a blueprint for maintaining operational integrity and compliance in policy enforcement across related teams and tools."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0252.md",
    "size_bytes": 4274,
    "ext": ".md",
    "description": "This document outlines implementation guidelines and operational policies for managing non-technical processes such as training, evidence handling, and administrative controls within the system. It details feature flag usage, admin tools for rule enforcement, data privacy measures, communication clarity, and ongoing staff training to ensure compliance and efficiency. As part of the larger system, it supports governance, auditability, and continuous improvement of support, finance, and compliance functions."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0253.md",
    "size_bytes": 4277,
    "ext": ".md",
    "description": "This document is a non-technical policy and process blueprint outlining terms of service, privacy, acceptable use, and operational procedures for a US-based creative marketplace platform. It defines key policies on content handling, payments, user eligibility, and admin tools, emphasizing legal compliance, data privacy, and auditability. The file supports product and operations teams by providing clear guidelines and implementation notes to align platform features with regulatory and business requirements."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0254.md",
    "size_bytes": 4286,
    "ext": ".md",
    "description": "This document defines the platform’s non-technical policies and operational procedures related to contract terms, user eligibility, fees, content licensing, acceptable use, safety, enforcement, data privacy, and compliance. It serves as a comprehensive blueprint guiding legal, moderation, and operational teams on terms of service management, content and user conduct enforcement, data handling, and risk mitigation within the larger system. Additionally, it includes templates, audit metrics, and detailed scenario playbooks to ensure consistent policy application and regulatory compliance."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0255.md",
    "size_bytes": 4236,
    "ext": ".md",
    "description": "This document outlines detailed operational procedures and guardrails for handling various non-technical scenarios such as legal disputes, DMCA notices, accessibility complaints, and emergency disclosures. It defines intake checklists, decision trees, admin actions, audit fields, and user messaging while ensuring legal compliance by deferring legal conclusions to counsel. Serving as a blueprint, it guides product, operations, and admin teams on executable steps, feature flag controls, audit logging, and training within the broader system governance framework."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0256.md",
    "size_bytes": 4277,
    "ext": ".md",
    "description": "This document outlines the implementation guidelines and operational procedures for managing policy enforcement within the system, including feature flag usage, admin tools for rule management, evidence handling, communication clarity, training schedules, and performance measurement. It serves as a blueprint for ensuring consistent, auditable, and compliant handling of policy decisions across teams such as Training & Support, Finance, and Admin. This file fits into the larger system by defining non-technical standards and processes that support reliable and transparent policy administration."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0257.md",
    "size_bytes": 4275,
    "ext": ".md",
    "description": "This document outlines policies and implementation guidelines for managing non-technical processes related to evidence handling, communication clarity, training, and performance measurement. It emphasizes secure evidence hygiene, clear customer communication, regular staff training, and operational controls via feature flags and admin tools with audit logging. The file serves as a blueprint to ensure compliance, transparency, and effective administration within the broader system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0258.md",
    "size_bytes": 4281,
    "ext": ".md",
    "description": "This document serves as a policy and process blueprint for managing content and safety on a US-only creative marketplace platform. It outlines key operational controls such as feature flag governance, admin tools with audit logs, evidence handling, communication clarity, staff training, and performance measurement to ensure compliance and effective moderation. Positioned within the larger system, it guides product and operations teams in implementing and maintaining non-technical policies for public-facing artistic content and related administrative workflows."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0259.md",
    "size_bytes": 4297,
    "ext": ".md",
    "description": "This document defines the content policies, safety measures, and operational procedures for a US-only creative marketplace focused on artistic nudity and creative media. It outlines allowed content types, consent and harassment rules, Safe-Mode defaults, moderation workflows, and enforcement actions to protect creators and viewers while enabling monetization and secure transactions. The blueprint supports platform governance by guiding public content standards, moderation, appeals, and administrative controls within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0260.md",
    "size_bytes": 4259,
    "ext": ".md",
    "description": "This document outlines comprehensive policies, procedures, and templates for non-technical moderation and compliance workflows, including data privacy, safety enforcement, appeals, and risk mitigation. It provides detailed scenario-based guides for handling complex cases such as legal disputes, emergency disclosures, and accessibility complaints, ensuring consistent operational and legal alignment. As part of the larger system, it supports moderation teams and compliance officers in maintaining platform safety, user trust, and regulatory adherence."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0261.md",
    "size_bytes": 4261,
    "ext": ".md",
    "description": "This document outlines detailed procedures and operational guidelines for handling non-technical cases such as anti-discrimination reports and chargebacks within the system. It defines intake checklists, decision trees, admin actions, audit requirements, and communication protocols while emphasizing legal compliance and evidence management. Serving as a blueprint for policy enforcement and admin operability, it integrates feature flags, audit logging, training, and measurement to ensure consistent and compliant case handling across teams."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0262.md",
    "size_bytes": 4274,
    "ext": ".md",
    "description": "This document outlines policies and implementation guidelines for managing non-technical workflows related to evidence handling, administrative controls, and compliance (e.g., PII redaction, legal holds). It details operational features like feature flags, admin tools with immutable logs, training programs, and measurement metrics to ensure clarity, security, and regulatory adherence. As part of the larger system, it supports governance and auditability for non-technical processes across teams such as Training & Support, Finance, and Administration."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0263.md",
    "size_bytes": 4277,
    "ext": ".md",
    "description": "This document outlines implementation guidelines for managing policy toggles, administrative tools, and evidence handling within a non-technical system. It emphasizes secure feature flag usage, comprehensive admin operability with audit logs, data privacy through evidence hygiene, clear communication, ongoing training, and performance measurement. These practices ensure controlled policy deployment, operational transparency, legal compliance, and continuous improvement in the broader organizational process."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0264.md",
    "size_bytes": 4277,
    "ext": ".md",
    "description": "This document is a policy and process blueprint outlining the implementation of optional background checks and FCRA-compliant procedures for a US-only creative marketplace platform. It details consent requirements, admin tools, feature flag controls, privacy protections, and training to ensure safe, lawful, and auditable handling of background screening data for providers opting into the Trusted Pro program. The file supports product and operations planning by defining rules and workflows that integrate with admin consoles and marketplace features to balance safety with user accessibility."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0265.md",
    "size_bytes": 4279,
    "ext": ".md",
    "description": "This document defines the policies, procedures, and operational playbooks for managing Trusted Pro background checks without credit checks, including consent capture, decision workflows, notices, dispute handling, and data privacy. It ensures compliance with legal requirements, enforces admin responsibilities, and provides templates and metrics for auditing and risk mitigation. As part of the larger system, it governs how non-technical teams handle sensitive creator verification and safety-related decisions while maintaining user privacy and regulatory adherence."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0266.md",
    "size_bytes": 4243,
    "ext": ".md",
    "description": "This document defines operational procedures and governance for handling various non-technical scenarios such as tax quote outages, emergency disclosure requests, accessibility complaints, and anti-discrimination reports. It outlines intake checklists, decision trees, user messaging, admin actions, audit fields, and guardrails to ensure consistent, legally compliant, and executable workflows. Additionally, it details implementation notes on feature flags, admin tools, evidence management, communication clarity, training, and performance measurement to support policy enforcement and operational effectiveness within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0267.md",
    "size_bytes": 4277,
    "ext": ".md",
    "description": "This document outlines the policies and operational guidelines for managing externally visible feature flags and administrative controls within a non-technical system. It details procedures for admin operability, evidence handling, communication clarity, staff training, and performance measurement to ensure compliance, auditability, and effective governance. As part of the larger system, it supports controlled feature deployment, rule enforcement, and continuous improvement through monitoring and training."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0268.md",
    "size_bytes": 4276,
    "ext": ".md",
    "description": "This document outlines the implementation guidelines and operational procedures for a non-technical policy enforcement system, focusing on feature flag management, admin tools for rule enforcement, evidence handling, communication clarity, training, and performance measurement. It ensures secure, auditable, and compliant policy application with ongoing staff training and data-driven tuning. This file serves as a blueprint for maintaining consistent and transparent policy administration within the larger organizational framework."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0269.md",
    "size_bytes": 4276,
    "ext": ".md",
    "description": "This document serves as a policy and process blueprint for launching a US-only creative marketplace focused on models, photographers, videographers, and content creators. It outlines key operational principles such as evidence hygiene, admin operability, feature flag management, training, and measurement to ensure compliance, clarity, and effective administration. Positioned within product and operations planning, it guides implementation details and legal considerations without providing formal legal advice."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0270.md",
    "size_bytes": 4298,
    "ext": ".md",
    "description": "This document defines the policies, procedures, and templates governing licensing, model releases, and deliverables for paid creative bookings on the platform. It ensures clear rights management, dispute prevention, and compliance by standardizing agreements, usage rights, and enforcement mechanisms, integrating with features like Smart Docs and admin consoles. As part of the larger system, it supports legal and operational workflows that protect creators' copyrights while enabling buyers to license content appropriately."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0271.md",
    "size_bytes": 4243,
    "ext": ".md",
    "description": "This document outlines non-technical operational blueprints focused on managing legal and compliance scenarios such as license clarifications, dispute resolutions, and regulatory requests. It provides detailed intake checklists, decision trees, admin actions, and communication guidelines to ensure consistent handling of complex cases while deferring legal judgments to counsel. Serving as a procedural reference, it supports product and operations teams in executing policy-driven workflows within a larger compliance and risk management system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0272.md",
    "size_bytes": 4274,
    "ext": ".md",
    "description": "This document outlines the implementation guidelines and operational guardrails for managing policy enforcement in a non-technical context. It details features such as feature flags for policy toggles, admin tools for rule management with audit logs, evidence handling protocols to ensure data integrity and privacy, clear user communication strategies, ongoing training programs, and performance measurement practices. Serving as a blueprint, it supports consistent, compliant, and auditable policy execution within the larger organizational system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0273.md",
    "size_bytes": 4275,
    "ext": ".md",
    "description": "This document outlines policies and implementation guidelines for handling Personally Identifiable Information (PII) within the system, emphasizing evidence integrity, admin operability, and compliance with legal holds. It details operational controls such as feature flags, audit logging, and admin tools for managing data rules, alongside training and communication best practices. This file serves as a non-technical blueprint to ensure secure, compliant, and transparent management of sensitive information across relevant teams."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0274.md",
    "size_bytes": 4277,
    "ext": ".md",
    "description": "This document outlines the operational and implementation guidelines for managing policy rules within an administrative system, emphasizing secure evidence handling, admin tools with immutable logs, and controlled feature rollouts via feature flags. It supports compliance and transparency by detailing processes for redaction, legal holds, and user communication, while also including training and measurement strategies to optimize performance. This file fits into the larger system as a non-technical blueprint guiding policy enforcement and administrative operability."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0275.md",
    "size_bytes": 4290,
    "ext": ".md",
    "description": "This document is a policy and process blueprint outlining the handling of payments, refunds, chargebacks, and related operational procedures for a US-only creative marketplace platform. It defines clear rules for escrowed transactions, dispute representment, fee disclosures, and admin tools to ensure compliance, transparency, and efficient support workflows. The file supports product and operations teams by providing guidelines, measurement metrics, and training to manage financial flows and customer interactions within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0276.md",
    "size_bytes": 4265,
    "ext": ".md",
    "description": "This document defines operational procedures, enforcement policies, compliance metrics, and risk mitigations related to payments, refunds, disputes, and legal scenarios within the platform’s non-technical support and finance functions. It provides detailed playbooks, templates, and checklists for handling common and complex cases such as chargebacks, off-platform payments, DMCA notices, and emergency disclosures, ensuring consistent execution while maintaining legal and privacy compliance. As part of the larger system, it guides internal teams on managing financial transactions, user disputes, and regulatory requirements to uphold platform integrity and user trust."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0277.md",
    "size_bytes": 4257,
    "ext": ".md",
    "description": "This document outlines detailed operational blueprints for handling various non-technical scenarios such as emergency disclosure requests, accessibility complaints, anti-discrimination reports, and chargeback disputes. It defines intake procedures, decision trees, admin actions, audit requirements, and communication guidelines while emphasizing legal compliance and administrative controls like feature flags and audit trails. Serving as a procedural reference, it supports consistent execution and governance within the broader organizational policy and operations framework."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0278.md",
    "size_bytes": 4276,
    "ext": ".md",
    "description": "This document outlines implementation guidelines and operational policies for managing non-technical processes such as compliance (FCRA basics), chargeback representment, and accessibility etiquette. It details administrative controls including feature flags, audit logging, evidence handling, and communication clarity, as well as training and measurement strategies to ensure effective policy enforcement. This file serves as a blueprint for supporting teams like T&S, Support, and Finance within the larger organizational system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0279.md",
    "size_bytes": 4277,
    "ext": ".md",
    "description": "This document outlines the implementation and operational guidelines for managing policy enforcement within the system, focusing on feature flags, admin tools, evidence handling, communication clarity, training, and performance measurement. It ensures secure and auditable administration of rules with immutable logs, protects sensitive information, and supports compliance through regular training and monitoring. This file serves as a blueprint for non-technical teams to maintain policy integrity and operational consistency across the platform."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0280.md",
    "size_bytes": 4282,
    "ext": ".md",
    "description": "This document serves as a policy and process blueprint for launching and operating a US-only creative marketplace, detailing administrative controls, compliance measures, and operational workflows. It outlines feature flag usage, admin tools with audit logs, evidence handling, training protocols, and measurement strategies to ensure secure, compliant, and reversible feature deployment. Positioned within the larger system, it guides product, operations, and legal teams on managing marketplace policies, tax handling, and user safety without embedding legal advice."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0281.md",
    "size_bytes": 4286,
    "ext": ".md",
    "description": "This document outlines the tax policy and operational procedures for handling sales and transaction taxes on taxable services in the US, relying on an external tax engine for jurisdiction determination and rate calculation. It defines roles, receipt requirements, refund handling, compliance metrics, and risk mitigations, ensuring accurate tax collection, reporting, and user communication within the larger financial and legal compliance system. Additionally, it includes detailed playbooks and scenarios for tax-related disputes and off-platform interactions to guide administrative and operational responses."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0282.md",
    "size_bytes": 4239,
    "ext": ".md",
    "description": "This document outlines detailed operational procedures and governance frameworks for handling various non-technical scenarios such as legal notices, complaints, and chargebacks. It defines intake checklists, decision trees, admin actions, audit requirements, and guardrails to ensure consistent, compliant, and executable workflows while avoiding direct legal conclusions in user communications. Serving as a reference for cross-functional teams, it supports policy enforcement, admin operability, evidence management, training, and measurement within the broader system of non-technical project and risk management."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0283.md",
    "size_bytes": 4279,
    "ext": ".md",
    "description": "This document outlines the operational and implementation guidelines for an administrative policy management system, focusing on rule enforcement, auditability, and evidence handling. It details admin tools for managing rules with immutable logs, ensures data integrity and privacy through evidence hygiene practices, and emphasizes clear communication and ongoing training. The file fits into the larger system by defining how policies are controlled, monitored, and refined to maintain compliance and operational effectiveness."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0284.md",
    "size_bytes": 4277,
    "ext": ".md",
    "description": "This document outlines the implementation guidelines and operational policies for managing non-technical processes related to compliance, evidence handling, and administrative controls, including FCRA basics and chargeback representment. It details feature flag usage, admin tools for rule enforcement with audit logs, evidence hygiene practices, communication clarity, and ongoing training requirements. The file serves as a blueprint to ensure consistent, auditable, and legally compliant handling of policies within the larger system."
  },
  {
    "path": "docs/blueprints/non-tech/NT-0285.md",
    "size_bytes": 4278,
    "ext": ".md",
    "description": "This document serves as a policy and process blueprint focused on data protection, evidence handling, and administrative operability within non-technical teams. It outlines implementation guidelines such as feature flag controls, immutable logging, PII redaction, training requirements, and measurement metrics to ensure compliance and operational clarity. Positioned within the larger system, it guides product and operations planning without providing legal advice, ensuring consistent and auditable handling of sensitive information."
  }
]